if instruct_5() == false then  --是否与之过招
	Cls()  --清屏
	do return end  --无条件结束事件

end
if WarMain(131, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(25, 20)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
instruct_66(23)  --播放音乐MIDI
TalkEx("禀盟主，东门已经攻克", 57, 0)  --对话
Cls()  --清屏
TalkEx("阿弥陀佛，南门已经攻克", 70, 0)  --对话
Cls()  --清屏
TalkEx("西门已也攻克了", 60, 0)  --对话
Cls()  --清屏
TalkEx("北门大捷。", 5, 0)  --对话
Cls()  --清屏
TalkEx("好，众位齐心协力，倭寇不*堪一击。你！还有什么话说*？", 0, 1)  --对话
Cls()  --清屏
TalkEx("中华，伟大的！*入侵，我们永远地不敢。", 266, 0)  --对话
Cls()  --清屏
TalkEx("你终于不辱使命，拯救了中*华武林啊。", 255, 0)  --对话
Cls()  --清屏
TalkEx("也没有枉费我兄弟二人对你*的一番培养。", 256, 0)  --对话
Cls()  --清屏
instruct_40(2)  --设置主角方向
Cls()  --清屏
TalkEx("对了，你们曾经说过，我来*自龙之国度，这龙之国度到*底在哪里呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("看到这面镜子了吗？你在镜*子中看到的，就是龙之国度*。", 256, 0)  --对话
Cls()  --清屏
TalkEx("回去吧，年轻人，回到真正*的龙之国度。", 255, 0)  --对话
Cls()  --清屏
instruct_30(25,20,25,19)  --人物移动
instruct_30(25,19,21,19)  --人物移动
TalkEx("每一位龙的传人，都应该以*国家的富强和民族的兴旺为*己任，巨龙正在苏醒，巨龙*终将腾飞！*我要走了，龙之国度正需要*我！", 0, 1)  --对话
Cls()  --清屏
instruct_62(0,0,0,0,0,0)  --游戏结束动画CG
do return end
