if instruct_4(204) then  --是否使用物品
	instruct_37(2)  --增加品德
	instruct_32(204,-1)  --得到或失去物品
	TalkEx("苗大侠，我这就帮你敷上解*药。", 0, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(3, 9,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 12,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 11,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 10,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, -2,-2,0,15,0,0,5216,5216,5216,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 12,1,0,14,0,0,5166,5166,5166,-2,-2,-2)  --修改场景事件
	instruct_3(70, 5,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_21(1)  --离开队伍
	instruct_45(3,100)  --增加轻功
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("苗大侠，你觉得怎麽样。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("嗯！我觉得好多了。***少侠一路辛苦了，苗某不胜*感激。*这毒手药王也真是厉害，用*毒至深，想不到医术也是一*流。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("药王他老人家已过世了，*这解药是他徒弟调制的。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("难怪，当年我因为一件事曾*与药王有过冲突，所以当我*听说要去求毒手药王时，*我就劝你不要去。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("是什麽事？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("这一件事我到今日还是不能*明白。**十八年前，我误伤了一位好*友，只因兵刃上喂有剧毒，*见血封喉，竟尔无法挽救。*我想这毒药如此厉害，多半*与毒手药王有关，因此去向*他询问。*结果他一口否认，说他毫不*知情，想我一来不会说话，*二来心情甚恶，就打了起来", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("如此说来，这位好朋友是你*亲手杀死的了？", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("是的。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("这好朋友姓啥叫什麽？", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("辽东大侠胡一刀。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("当真是你杀了我父亲。", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("你是胡一刀的儿子！*好，快来将我杀了，替你爹*报仇。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("且慢。这中间有很大的误会*。当年在苗大侠剑上偷偷喂*毒的是名叫阎基的人。他因*为知道苗，胡二人身上有两*本极重要的书，所以在两人*比武时偷偷喂上剧毒，想让*二人两败俱伤，他好坐收渔*翁之利。只是，当初你二人*为何比试，才让阎基这小人*从中搞鬼？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("唉！当年我二人都在寻找十*四天书。当时，我二人各找*到一本，双方都想把对方的*书夺来，所以才相约比试。*其实，只要好好讲，或许我*们可以一起去找寻这些书，*但可能是听双方名声太大，*本就想互相较量一下，看看*是他的胡家刀法厉害，还是*我苗家剑法强。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("这真是一场误会。一切都是*阎基那卑鄙小人所引起的，*所幸这个小人已无法再作恶*了。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("照你这麽说，是我胡家刀法*比不上你苗家剑法，所以死*的才是我父亲。", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("其实我心中有个遗憾，当年*我砍到令尊手臂时，同时我*也被令尊的後着踢倒在地，*只因我剑上被喂上剧毒，令*尊才会毒发死亡。所以到底*是何者功夫高明，一直没有*答案。今天我看见你这麽大*了，我很高兴。但我更希望*你能学好胡家刀法，让胡家*刀法发扬光大。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("胡大哥，你刚得到胡家刀法*的残页，想必还有许多未解*之处。苗大侠乃当时英雄，*定可给你指点一二。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("可……可是他是我的杀父仇*人啊", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("苗大侠光明磊落，又是你父*亲昔日好友。当年之事纯属*误会。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("我也希望你能留下来。当年*我曾与你爹连战三天三夜，*未分胜负。对胡家刀法，当*世恐怕没有人比我更了解。*你目前的武功，与你爹当年*相去甚远。你在我这里学好*胡家刀法，到时你若想报仇*，我们就轰轰烈烈的打一场*。你信不过我苗人凤吗？", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("好，那我就留下来潜心学习*胡家刀法。可是你别忘了，*我迟早有一天，要为父报仇*。", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("很好。这位少侠，你救了苗*某性命，苗某理应有所报答*。但江湖有江湖的规矩。待*我将胡家刀法尽数传于胡斐*以后，你再来找我，若能胜*的了苗某手中剑，你想要的*天书自然奉上。", 3, 0)  --对话
	Cls()  --清屏
	TalkEx("如此甚好。胡大哥，你在此*安心学习刀法，小弟也要出*去四处磨练。咱们后会有期*。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("兄弟，保重。", 1, 1)  --对话
	Cls()  --清屏
	instruct_32(199,-1)  --得到或失去物品
	do return end  --无条件结束事件

end
Cls()  --清屏
do return end
