--重写4MM离队事件

--OEVENTLUA[198] = function()

    if JY.Person[92]["姓名"] == "郭襄" then
    	Talk("郭姑娘，你先回小村，有需*要时，我再去找你帮忙。",0);
    elseif JY.Person[92]["姓名"] == "赵敏" then
    	Talk("赵姑娘，你先回小村，有需*要时，我再去找你帮忙。",0);
    elseif JY.Person[92]["姓名"] == "周芷若" then
    	Talk("周姑娘，你先回小村，有需*要时，我再去找你帮忙。",0);
    elseif JY.Person[92]["姓名"] == "陆无双" then
    	Talk("陆姑娘，你先回小村，有需*要时，我再去找你帮忙。",0);
    end
    
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_21(92);   --  21(15):[4MM]离队
    instruct_3(70,1,1,0,199,0,0,7266,7266,7266,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [1]
--end