instruct_67(22)  --播放音效WAV
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
TalkEx("咦！这是什麽声音？难道洞*中藏有怪物？待我进去看个*究竟。", 0, 1)  --对话
Cls()  --清屏
instruct_30(25,49,25,38)  --人物移动
TalkEx("哇塞！鵰蛇大战，精彩！．*．．．咦！鵰兄似乎快不行*了，看我的！", 0, 1)  --对话
Cls()  --清屏
if WarMain(66, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(210, 8)  --得到或失去物品
Cls()  --清屏
TalkEx("这巨蟒还真难对付，*总算把牠搞定了．**鵰兄，你还好吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("咦？雕兄怎么跑了？这只雕*颇有灵性，好像要带我到里*边去……", 0, 1)  --对话
Cls()  --清屏
instruct_37(2)  --增加品德
do return end
