TalkEx("这位兄台，不知洞中那头大*鵰是你驯养。。。**咦！你的手臂？*莫非是那头大鵰所。。。**唉！我刚还救了牠，早知就*该让牠被巨蟒咬死算了。", 0, 1)  --对话
Cls()  --清屏
TalkEx(" 巨蟒？你说你救了鵰兄，*杨过在此谢过。", 58, 0)  --对话
Cls()  --清屏
TalkEx("你的伤不是那鵰所为？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不是。", 58, 0)  --对话
Cls()  --清屏
TalkEx("但你看起来像是最近才受伤*的，不知杨兄有何困难，是*否要在下相助？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这伤？唉！不提也罢？", 58, 0)  --对话
Cls()  --清屏
TalkEx("莫非是女人所为？", 0, 1)  --对话
Cls()  --清屏
TalkEx("阁下怎会知道？", 58, 0)  --对话
Cls()  --清屏
TalkEx("我是随便猜猜的，因为自古*以来，只有贱女人才会变态*到砍人手臂。", 0, 1)  --对话
Cls()  --清屏
TalkEx("唉！我们不谈这些了。*不知少侠为何会到此地？", 58, 0)  --对话
Cls()  --清屏
TalkEx("老实说我是在找一些东西，*找东西当然是要往隐密的*地方去找。*找着找着就到了这山谷。*一进洞後，便看到大鵰与巨*蟒正在缠斗。*那只大鵰是杨兄饲养的吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不是的。*其实我也是无意中来到这山*谷，才发现鵰兄的。後来相*处了一段时间，我们就成了*好朋友。**据我在洞中所见，这鵰应是*一位名为独孤求败的前辈所*养的。", 58, 0)  --对话
Cls()  --清屏
TalkEx("独孤求败？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是的，这位前辈号称自己为*\"剑魔独孤求败\"。在他遗*留下的字迹中这样子写到：*\"纵横江湖三十余载，杀尽*仇寇，败尽英雄，天下更无*抗手，无可奈何，惟隐居深*谷，以鵰为友。*呜呼，生平求一敌手而不可*得，诚寂寥难堪也。\"*这位前辈只因世上无敌，只*得在深山隐居，其武功之深*湛，真不知到了何等地步。*此人号称\"剑魔\"，自是运*剑若神，名字叫\"求败\"，*想是走遍天下欲寻一胜己之*人，始终未能如愿，终於在*此处郁郁以没。**每每缅怀到此前辈的风采，*就不禁。。咳。咳。。不禁*令人向往。。咳 。咳。。。*一兴起话就说太多了。", 58, 0)  --对话
Cls()  --清屏
TalkEx("杨兄身上似乎有伤？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不瞒少侠，*杨某身中\"情花\"之毒，恐*怕活不了多久了。", 58, 0)  --对话
Cls()  --清屏
TalkEx("杨兄这什麽话，兄弟我帮你*去找个名医来看看，天下那*有治不好的病。", 0, 1)  --对话
Cls()  --清屏
TalkEx("不劳少侠费心了，这情花乃*是绝情谷独有之物，天下无*药可解。", 58, 0)  --对话
Cls()  --清屏
TalkEx("看我得先上绝情谷走一趟，*看这\"情花\"到底长得什麽*模样。*或许在谷中有收获也说不定*呢。**常听人说毒蛇出没之处，七*步之内必有解毒之药。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那少侠可得小心，别被那情*花刺到，否则。。。", 58, 0)  --对话
Cls()  --清屏
TalkEx("否则这世上就多了个跟杨兄*\"同病相怜\"的人。*我这就去了，请杨兄保重。", 0, 1)  --对话
Cls()  --清屏
TalkEx("对了，那绝情谷地处偏僻，*你必须乘船顺着黄河而上，*才到得了。", 58, 0)  --对话
Cls()  --清屏
TalkEx("杨兄，你撑着点，*我会尽快找出这情花之毒的*医治方法。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,216,217,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
