instruct_37(2)  --增加品德
instruct_26(60,4,1,0,0)  --修改场景事件
instruct_26(60,5,1,0,0)  --修改场景事件
instruct_26(60,3,1,0,0)  --修改场景事件
instruct_30(20,26,20,29)  --人物移动
instruct_30(20,29,15,29)  --人物移动
Cls()  --清屏
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
TalkEx("咦？这不是全真派的周老爷*子么？怎么好像中毒了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("乖乖，老顽童差点归西。你*是谁？", 64, 0)  --对话
Cls()  --清屏
TalkEx("周老爷子怎么忘了，我们在*桃花岛上见过一面的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你刚才进来的时候，有没有*看见好多蜘蛛？", 64, 0)  --对话
Cls()  --清屏
TalkEx("有啊，我差点没被这些蜘蛛*咬到！现在已经被我消灭干*净了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("金轮那个秃驴呢？", 64, 0)  --对话
Cls()  --清屏
TalkEx("什么金轮？我进来的时候没*看见别人啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx("算他跑得快，哼！居然用蜘*蛛害我。这不知道是什么蜘*蛛，毒性如此厉害。多亏了*女娃娃的蜂针。你帮我赶走*了蜘蛛，也要谢谢你。", 64, 0)  --对话
Cls()  --清屏
TalkEx("我也是无意中路过此地。", 0, 1)  --对话
Cls()  --清屏
TalkEx("老顽童平生从不欠别人的，*既然你帮我赶跑了蜘蛛，我*就教你七十二路空明拳法吧*。", 64, 0)  --对话
Cls()  --清屏
instruct_2(98, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("哈哈，老顽童命大，死不了*。金轮这个臭贼秃，我要去*找他算帐。老顽童去也！", 64, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("＜哇！这姑娘真美，好像神*  仙一般＞，姑娘你好", 247, 1)  --对话
Cls()  --清屏
TalkEx("好", 59, 0)  --对话
Cls()  --清屏
TalkEx("姑娘是否也中了蜘蛛的毒？", 0, 1)  --对话
Cls()  --清屏
TalkEx("没有", 59, 0)  --对话
Cls()  --清屏
TalkEx("敢问姑娘芳名？", 0, 1)  --对话
Cls()  --清屏
TalkEx("他们都叫我小龙女。", 59, 0)  --对话
Cls()  --清屏
TalkEx("＜这姑娘怎么冰冰冷冷的…*…＞姑娘要到哪里去，在下*送你一程如何？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我要去找过儿，我自己找。", 59, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("这姑娘真的好美啊，就是冰*冰冷冷的，让人难以接近，*不知道过儿是谁，会是她的*心上人么？谁这么有福气啊*……", 0, 1)  --对话
Cls()  --清屏
instruct_26(19,24,0,0,1)  --修改场景事件
instruct_3(20, 4,1,0,1046,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
instruct_3(21, 10,1,0,1047,0,0,6158,6158,6158,-2,-2,-2)  --修改场景事件
do return end
