--OEVENTLUA[227] = function()
    instruct_14();   --  14(E):场景变黑
    instruct_26(60,4,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,5,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,1,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,10,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,22,0,0,0,0,0,6108,6108,6108,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,0,0,0,6112,6112,6112,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,18,0,0,0,0,0,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,0,0,0,6762,6762,6762,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,6762,6762,6762,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,0,0,0,0,0,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,14,0,0,0,0,0,6802,6802,6802,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,0,0,0,5894,5894,5894,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,17,0,0,0,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(32,49,32,44);   --  30(1E):主角走动32-49--32-44
    instruct_30(32,44,28,44);   --  30(1E):主角走动32-44--29-44
    instruct_30(28,44,28,40);   --  30(1E):主角走动29-44--29-41
    instruct_1(536,0,1);   --  1(1):[AAA]说: 打的这么热闹啊……一堆和*尚老道，围着一对小情人…*…这不是杨兄么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(537,58,0);   --  1(1):[杨过]说: 正是杨某。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(538,0,1);   --  1(1):[AAA]说: 这位小龙女姑娘，难道就是*你的……姑姑？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(539,58,0);   --  1(1):[杨过]说: 不错，她就是……不，她从*前是我的师父，是我的姑姑*，但是现在，什么师徒名分*，什么名节清白，我通通当*是放屁！通通滚他妈的蛋！*姑姑，不，龙儿，死也罢，*活也罢，咱俩谁也没命苦，*谁也不会孤苦伶仃。从今而*后，你不是我的师父，不是*我的姑姑，是我媳妇！是我*妻子！是我老婆！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(540,59,0);   --  1(1):[小龙女]说: 过儿，这是你的真心话么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(541,58,0);   --  1(1):[杨过]说: 自然是真心。我断了手臂，*你更加怜惜我；你遇到了什*么灾难，我也更加怜惜你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(542,59,0);   --  1(1):[小龙女]说: 是啊，世上除了你我两人自*己，原也没旁人怜惜。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(543,128,0);   --  1(1):[???]说: 重阳宫乃清修之地，岂容你*们俩在此胡言乱语。你们杀*了我师侄尹志平，又伤我全*真教众多门人，今日休想全*身而退！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(544,0,1);   --  1(1):[AAA]说: 多好的一对儿呀，你们怎么*忍心下手呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(545,62,0);   --  1(1):[金轮法王]说: 嘿嘿，你以为你就不忍心么*？老衲告诉你，你一直想要*的天书《神雕侠侣》，就在*杨过身上！只要杀了他，你*马上就可以得到。老衲倒要*看看你忍不忍心！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(546,0,1);   --  1(1):[AAA]说: 杨兄，这可是真的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(547,58,0);   --  1(1):[杨过]说: 不错，神雕侠侣就在我身上*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(548,0,1);   --  1(1):[AAA]说: ＜我该不该硬抢呢？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(0,318) ==true then    --  5(5):是否选择战斗？否则跳转到:Label0
        instruct_37(-5);   --  37(25):增加道德-5
        instruct_1(549,0,1);   --  1(1):[AAA]说: 杨兄，咱们也算是老朋友了*，能否将此书让给我？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(550,58,0);   --  1(1):[杨过]说: 哈哈哈，你想让我用天书换*一条命？你把杨某这条命看*得太值钱了！我的命可算是*你救的，今日便还给你又如*何？想要天书，你就上来吧*，杨某今日就没想活着从这*里走出去！能和龙儿死在一*起，我也算不枉此生。你来*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(551,59,0);   --  1(1):[小龙女]说: 过儿……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(552,244,1);   --  1(1):[???]说: 如此……得罪了……
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(75,4,0,0) then    --  6(6):战斗[75]是则跳转到:Label1
		end
			instruct_40(2);
			Talk("＜杨过和小龙女的武功实在高强，看来这天书只好另想办法。＞在下武功不如杨大侠，这天书还是你比较适合占有。",0);
			Talk("小兄弟你还是放弃这本天书吧，我不把天书交给你是因为你无法应对它带来的灾难。",58);
			Talk("＜本想让他们互相残杀，然后夺取他们身上的天书。以目前的局势，要是让他们联手可不好对付，只好趁现在。。＞",62);
			Talk("糟了，兄弟，小心！",58);
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
			instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
			SetS(19,29,40,3,40)
			SetS(19,30,40,3,41)
			instruct_3(-2,40,0,0,0,0,0,6190,6190,6190,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
			instruct_3(-2,41,0,0,0,0,0,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
			instruct_40(1);
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			Talk("过儿！！",59);
			Talk("情况不妙，龙姑娘，你先带杨兄逃离此地，由我来对付金轮这帮人。",0);	
			instruct_1(559,123,0);   --  1(1):[???]说: 重阳宫重地，岂容邪魔外道*撒野！
			if instruct_6(73,4,0,0) ==false then    --  6(6):战斗[73]是则跳转到:Label3
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_15(0);   --  15(F):战斗失败，死亡
				do return; end
			end --Label3
			--杨龙逃离
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
			instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
			instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
			instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
			instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
			instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
			instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
			instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
			instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
			instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
			instruct_3(18,1,1,0,8201,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [1]
			instruct_3(18,0,1,0,8201,0,0,6190,6190,6190,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [0]
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			Talk("＜这下惨了，和杨龙夫妇他们战斗消耗的内力不少，再加上刚才对付那些臭道士，别说拖时间，就算想逃都逃不了。。＞",0);
			Talk("先干掉这小子再追小龙女。上吧！",62);
			Talk("＜神啊救救我吧。＞",0);
			instruct_3(-2,3,0,0,0,0,0,8230,8230,8230,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			Talk( "要打架怎么没叫我。",64);
			Talk("这老顽童不好对付，走！",62);
			--金轮逃离
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
			instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
			instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
			instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
			instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
			instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			Talk("多谢老顽童出手相救！",0);
			Talk("他们都跑了，我们玩玩吧。",64);
			Talk("抱歉，我现在没空和你玩，改天有空再到百花谷陪你玩。",0);
			Talk("既然大家都不陪我玩，我自己玩！",64);
			instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			Talk("这老顽童。。还是快点去看看杨过的伤势如何。他们应该到了附近的古墓吧。",0);
    else
	instruct_37(3);   --  37(25):增加道德3
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(557,245,1);   --  1(1):[???]说: 你当我是什么人！就算为了*天书，也不能违背做人的原*则。你们想伤害杨兄和龙姑*娘，就要先过我这关！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(558,62,0);   --  1(1):[金轮法王]说: 小子想充当英雄，那就来吧*，试试我的龙象般若功！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(74,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2

    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(559,123,0);   --  1(1):[???]说: 重阳宫重地，岂容邪魔外道*撒野！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(560,0,1);   --  1(1):[AAA]说: 我是邪魔歪道？？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(561,127,0);   --  1(1):[???]说: 哼，今日休想离开重阳宫！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(562,68,0);   --  1(1):[丘处机]说: 天罡北斗阵！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(73,4,0,0) ==false then    --  6(6):战斗[73]是则跳转到:Label3
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label3

    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(564,0,1);   --  1(1):[AAA]说: 杨大哥，龙姑娘，你们没事*吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(563,58,0);   --  1(1):[杨过]说: 现在龙儿身受重伤，我们要*赶紧返回古墓了。大恩不言*谢，少侠有空可到古墓来找*我夫妇。龙儿，我们回家。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(18,1,1,0,231,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [1]
    instruct_3(18,0,1,0,231,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [0]
    instruct_17(18,1,22,41,0);   --  17(11):修改场景贴图:场景[古墓]层1坐标16-29
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	end
--end		
