TalkEx("杨兄，龙姑娘，一切可好，*龙姑娘伤势如何了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("已经不碍事了，多谢少侠*关心", 59, 0)  --对话
Cls()  --清屏
TalkEx("我夫妇得少侠多次多次相救*，深感大恩，若少侠有需要*之处，我夫妇自当尽力帮忙*。", 58, 0)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("近日旅途有些不顺，如能得*杨兄和龙姑娘相助，真是再*好不过了。", 247, 1)  --对话
Cls()  --清屏
TalkEx("既然如此，我们就直接去小*村了。", 58, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(104, 68,1,0,969,0,0,6186,6186,6186,-2,-2,-2)  --修改场景事件
instruct_3(104, 76,1,0,970,0,0,7242,7242,7242,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 19,1,0,151,0,0,6188,6188,6188,-2,-2,-2)  --修改场景事件
instruct_3(70, 20,1,0,153,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
instruct_37(2)  --增加品德
Cls()  --清屏
instruct_13()  --场景变亮
do return end
