instruct_37(-2)  --增加品德
instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
TalkEx("少侠，你来啦，我这就给你*引荐张大人。", 208, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(23, 29)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
instruct_25(23,29,23,29)  --场景移动
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("张大人，这位就是我和您说*的，在回疆帮了我们的少侠*。", 208, 0)  --对话
Cls()  --清屏
TalkEx("张大人，兴会兴会。", 0, 1)  --对话
Cls()  --清屏
TalkEx("少侠武功不凡，又有报国之*心，真是英雄出少年啊。", 80, 0)  --对话
Cls()  --清屏
TalkEx("张大人过奖了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("红花会那群反贼，近日要来*此捣乱，少侠既然有心效忠*朝廷，不妨留下来与老夫共*同抗敌。", 80, 0)  --对话
Cls()  --清屏
TalkEx("＜谁要效忠朝廷啊？我只不*过不想得罪你们而已……＞*这个……", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，少侠放心，老夫绝*不会亏待与你，来人啊。", 80, 0)  --对话
Cls()  --清屏
TalkEx("这是……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("区区纹银三千两，还望少侠*笑纳。", 80, 0)  --对话
Cls()  --清屏
instruct_2(174, 3000)  --得到或失去物品
Cls()  --清屏
TalkEx("这个，这个……不好吧……", 247, 1)  --对话
Cls()  --清屏
TalkEx("报效朝廷，自然会有封赏，*少侠就不必推辞啦。", 80, 0)  --对话
Cls()  --清屏
TalkEx("报告张大人，红花会的反贼*已经杀进来了。", 208, 0)  --对话
Cls()  --清屏
TalkEx("少侠，我要去后面守着囚禁*要犯之地，前面的来敌就拜*托少侠了。", 80, 0)  --对话
Cls()  --清屏
TalkEx("我……唉，拿人家的手短啊*……", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,5970,5970,5970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("又是你这小子，协助官兵，*为非作歹。", 152, 0)  --对话
Cls()  --清屏
TalkEx("我……＜真倒霉，天书没找*到，莫名其妙地得罪了红花*会。管不了那么多了，拿人*钱财，替人消灾，看来今日*只有和他们一战了＞", 0, 1)  --对话
Cls()  --清屏
if WarMain(139, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("少侠好身手，我果然没看错*人。", 80, 0)  --对话
Cls()  --清屏
TalkEx("那要犯可还安全？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你守前，我守后，红花会虽*然兵分两路，却是无功而返*。哈哈哈。", 80, 0)  --对话
Cls()  --清屏
TalkEx("＜我觉得还是离开这里比较*好……＞，既然此间事情已*了，我要告辞了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("也好，我料定这些反贼短期*内不会再回来了。只要我成*功把要犯押入京城，那就是*大功一件，哈哈。我还有个*比武约会，现在要赶去恒山*，咱们就此别过吧。", 80, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(38, 1,0,0,0,0,243,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
