instruct_37(-2)  --增加品德
instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,7050,7050,7050,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,5970,5970,5970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,6058,6058,6058,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,6786,6786,6786,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,5892,5892,5892,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,5454,5454,5454,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(50,36,33,36)  --人物移动
TalkEx("这不是张大人么？怎么这么*惨？", 0, 1)  --对话
Cls()  --清屏
TalkEx("少侠救我，他们一群人欺负*我一个。", 80, 0)  --对话
Cls()  --清屏
TalkEx("又是你，几次三番坏我红花*会的事，到底是何用意？", 75, 0)  --对话
Cls()  --清屏
TalkEx("其实……我没……", 0, 1)  --对话
Cls()  --清屏
TalkEx("少侠，我知道你一直要找十*四天书。最近我得到了《书*剑恩仇录》一书，准备送与*少侠，刚才被陈家洛抢去了*！", 80, 0)  --对话
Cls()  --清屏
TalkEx("陈总舵主，这天书对我至关*重要，还望赠与在下。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，天书乃武林至宝，怎能*交与你这种匪类。", 75, 0)  --对话
Cls()  --清屏
TalkEx("如此，得罪了。", 0, 1)  --对话
Cls()  --清屏
if WarMain(144, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("对付这种人，不必讲什么江*湖道义，大伙一起上！", 152, 0)  --对话
Cls()  --清屏
if WarMain(140, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(152, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("这下子武功厉害，大家暂避*一时。反正张召重护驾不利*，不是杀头，也要坐牢。我*们今日就放过他，咱们走！", 75, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("张大人，你没事吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("还好，多亏少侠及时赶到。", 80, 0)  --对话
Cls()  --清屏
TalkEx("张大人今后有什么打算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这群红花会的反贼，胆大包*天，那天没能劫走朝廷要犯*，居然就胁持了皇帝。我现*在回去，恐怕要被问个渎职*之罪。干脆暂避一时吧。我*先帮你找天书，以报答你的*救命之恩。待风声过后，再*找机会回朝中复职。", 80, 0)  --对话
Cls()  --清屏
TalkEx("＜要在我这避难啊……＞，*能得张大人相助，真是如虎*添翼啊。", 0, 1)  --对话
Cls()  --清屏
instruct_3(104, 85,1,0,981,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_14()  --场景变黑
	instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(80)  --加入队伍
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 80, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 52,1,0,175,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
