TalkEx("真儿，他就是我们的恩公张*翠山的儿子，你以后要好好*待他，就像亲弟弟一样。", 165, 0)  --对话
Cls()  --清屏
TalkEx("无忌，以后你就是我的亲弟*弟，姐姐疼你。", 81, 0)  --对话
Cls()  --清屏
TalkEx("姐姐……你待我真好……", 9, 0)  --对话
Cls()  --清屏
TalkEx("无忌这孩子真可怜，父母都*死了，唉，在这世上已经没*什么亲人了。", 165, 0)  --对话
Cls()  --清屏
TalkEx("不，我还有义父，他双目失*明，一个人住在冰火岛，孤*苦伶仃的，咱们去把他接来*吧。", 9, 0)  --对话
Cls()  --清屏
TalkEx("也好，咱们这就打点行装，*过两天就动身，把谢法王接*回来。", 165, 0)  --对话
Cls()  --清屏
instruct_3(-2, 15,0,0,0,0,250,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,250,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,1,0,251,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
