instruct_26(40,9,4,0,0)  --修改场景事件
instruct_26(40,10,4,0,0)  --修改场景事件
instruct_26(40,12,4,0,0)  --修改场景事件
TalkEx("谢前辈，*这是成崑的项上人头。*成崑作恶多端已遭天谴。", 0, 1)  --对话
Cls()  --清屏
TalkEx("是吗？哈！哈！*成崑啊，成崑！*你作恶多端终遭天谴，*但，可惜啊，可惜！*我不能亲手杀了你。", 13, 0)  --对话
Cls()  --清屏
TalkEx("成崑一事已了，谢法王能否……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("少侠为我明教付出许多，谢*某感激不尽。如今成崑已死*，这本《倚天屠龙记》你就*拿去吧。", 13, 0)  --对话
Cls()  --清屏
instruct_2(155, 1)  --得到或失去物品
instruct_2(219, -1)  --得到或失去物品
Cls()  --清屏
instruct_3(-2, -2,1,0,287,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
