instruct_14()  --场景变黑
instruct_3(-2, 21,0,0,0,0,0,5394,5394,5394,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,7040,7040,7040,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(26,45,17,45)  --人物移动
TalkEx("青书，我武当派是名门正派*，你怎能在此偷窥峨嵋派的*卧房？快跟我回去，向太师*父和你父亲请罪。", 172, 0)  --对话
Cls()  --清屏
TalkEx("七叔，你饶了我吧。我再也*不敢了。如果回去见了我爹*，他非打死我不可。我不能*回去，我不能回去……", 82, 0)  --对话
Cls()  --清屏
TalkEx("＜宋青书这小子倒是可以利*用，我是不是应该帮他一下*？＞", 0, 1)  --对话
Cls()  --清屏
if instruct_11() == false then  --是/否
	TalkEx("我不能回武当，不能回武当*……", 82, 0)  --对话
	Cls()  --清屏
	TalkEx("别跑……臭小子，给我站住*！", 172, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_37(1)  --增加品德
	do return end  --无条件结束事件

else
	instruct_37(-2)  --增加品德
	TalkEx("这位公子恐怕是爱上了峨嵋*派的某位佳人，这也是人之*常情嘛，莫七侠何必苦苦相*逼？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("这是我武当派自己的事，不*需旁人插手。", 172, 0)  --对话
	Cls()  --清屏
	TalkEx("我不回去，我不回去，少侠*救我啊……", 82, 0)  --对话
	Cls()  --清屏
	TalkEx("听到了吧，是他让我救他，*我也不得不管了。", 0, 1)  --对话
	Cls()  --清屏
	if WarMain(225, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件
		Cls()  --清屏

	else
		instruct_3(-2, 21,1,0,0,0,0,5440,5440,5440,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		instruct_13()  --场景变亮
		TalkEx("……啊……青书，你……居*然偷袭我……", 172, 0)  --对话
		Cls()  --清屏
		TalkEx("七叔，我……", 82, 0)  --对话
		Cls()  --清屏
		TalkEx("宋少侠，你亲手杀了你七叔*，这可是欺师灭祖的大罪啊*。", 0, 1)  --对话
		Cls()  --清屏
		TalkEx("我不能再回武当了，不能再*回了，我该去哪？", 82, 0)  --对话
		Cls()  --清屏
		TalkEx("跟着我吧，只要你好好帮我*，我就不会把这件事情说出*去的。", 0, 1)  --对话
		Cls()  --清屏
		TalkEx("……好吧。", 82, 0)  --对话
		Cls()  --清屏
		instruct_37(-3)  --增加品德
		instruct_3(104, 86,1,0,983,0,0,7040,7040,7040,-2,-2,-2)  --Alungky 将宋青书弄到86这个位置，70这个位置给霍都
		if instruct_20() == false then  --判断队伍是否已满
			instruct_14()  --场景变黑
			instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			Cls()  --清屏
			instruct_13()  --场景变亮
			instruct_10(82)  --加入队伍
			Cls()  --清屏
			do return end  --无条件结束事件

		else
			TalkEx("你的队伍已满，我就直接去*小村吧。", 82, 0)  --对话
			Cls()  --清屏
			instruct_14()  --场景变黑
			instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			Cls()  --清屏
			instruct_3(70, 54,1,0,179,0,0,7040,7040,7040,-2,-2,-2)  --修改场景事件
			instruct_13()  --场景变亮
			do return end
		end
	end
end
