if instruct_16(91) == false then  --是否在队伍
	TalkEx("青青，你在哪里啊，你在哪*里？", 54, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_14()  --场景变黑
instruct_3(-2, 14,1,0,350,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
instruct_21(91)  --离开队伍
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("青青，我终于找到你了……", 54, 0)  --对话
Cls()  --清屏
TalkEx("哼，你找我干什么，你怎么*不去找你青梅竹马的小慧姑*娘！", 91, 0)  --对话
Cls()  --清屏
TalkEx("她……她的心上人是她的崔*师哥，跟我有什么关系。", 54, 0)  --对话
Cls()  --清屏
TalkEx("你为什么用她的发钗？难道*我就没有发钗么？", 91, 0)  --对话
Cls()  --清屏
TalkEx("＜她这简直是无理取闹……*唉，算了，我还是别说话了*……＞*……", 54, 0)  --对话
Cls()  --清屏
TalkEx("你怎么不说话？见了她就笑*逐颜开，见了我就闷闷不乐*！", 91, 0)  --对话
Cls()  --清屏
TalkEx("我……我哪有？**青青，这些日子，你上哪里*去了？", 54, 0)  --对话
Cls()  --清屏
TalkEx("＜唉，这位温大小姐真让人*受不了，这位袁兄今后可要*受苦啦，我还是不要在这当*灯泡了＞，二位既已重逢，*在下这就告辞了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你还知道关心我啊！*我去了华山，把我父母合葬*在一起……*对了，袁大哥，你说过我爹*的金蛇剑法一定要配合金蛇*剑才有威力，我就让他帮我*把剑拔下来了，那，给你。", 91, 0)  --对话
Cls()  --清屏
instruct_32(40,-1)  --得到或失去物品
Cls()  --清屏
TalkEx("他？*哎呦，我们俩光顾着说话，*怠慢了兄台，还望见谅。多*谢兄台对……对她的照顾。", 54, 0)  --对话
Cls()  --清屏
TalkEx("谁要他来照顾？是他让我加*入他的队伍，给他做帮手！", 91, 0)  --对话
Cls()  --清屏
TalkEx("……＜这位大小姐，我可惹*不起＞，啊，是，温姑娘武*艺非凡，帮了在下不少忙。", 247, 1)  --对话
Cls()  --清屏
TalkEx("你听到没有！", 91, 0)  --对话
Cls()  --清屏
TalkEx("……*对了，我明日要去金龙帮，*不知兄台可有兴趣一同前往*？", 54, 0)  --对话
Cls()  --清屏
TalkEx("去金龙帮干什么？", 91, 0)  --对话
Cls()  --清屏
TalkEx("听说金龙帮的帮主焦公礼几*年前杀害了仙都派闵子华的*哥哥，所以闵子华邀请武林*好手，去找焦公礼报仇。", 54, 0)  --对话
Cls()  --清屏
TalkEx("几年前杀的？闵子华怎么知*道是焦公礼下的手？", 0, 1)  --对话
Cls()  --清屏
TalkEx("据说是太白三英告诉他的。", 54, 0)  --对话
Cls()  --清屏
TalkEx("太白三英？我刚才进来的时*候看见那三个家伙了，鬼鬼*祟祟的……", 0, 1)  --对话
Cls()  --清屏
TalkEx("恩，我也觉得他们有些奇怪*。兄台，不如我们去调查一*下如何？", 54, 0)  --对话
Cls()  --清屏
if instruct_11() then  --是/否
	instruct_37(2)  --增加品德
	TalkEx("调查一下也好，可不能冤枉*了好人。", 0, 1)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,1,0,349,325,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 5,1,0,324,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_37(-2)  --增加品德
TalkEx("管那么多干嘛！反正大家都*认为是焦公礼的错，咱们就*去凑凑热闹，就算灭了金龙*帮，也是为朋友帮忙！＜金*龙帮是地头蛇，可能还会有*不少收获……＞", 246, 1)  --对话
Cls()  --清屏
TalkEx("也好，那我们先休息一晚，*明天去金龙帮。", 54, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(59, 2,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 15,1,0,0,0,0,5434,5434,5434,-2,-2,-2)  --修改场景事件
instruct_3(59, 13,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 12,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 11,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 10,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 9,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 8,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 7,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 6,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 5,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 4,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 3,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 29,0,0,0,0,351,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_40(1)  --设置主角方向
instruct_13()  --场景变亮
TalkEx("糟糕，起来晚了，他们大概*都已经去了金龙帮了吧，我*也过去瞧瞧热闹。", 0, 1)  --对话
Cls()  --清屏
do return end
