instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_30(49,36,42,36)  --人物移动
TalkEx("青青、青青、你怎么样？", 54, 0)  --对话
Cls()  --清屏
TalkEx("温姑娘怎么了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("兄台来得正是时候，快拦住*那个恶道，他打伤了青青。", 54, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿，交给我了，我看你往*那跑。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，你们这么多人打我一个*，也不害臊。有本事单打独*斗！", 184, 0)  --对话
Cls()  --清屏
TalkEx("好，我就和你单打独斗。要*是我输了，随你下山。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，这话要是那穆老儿*说出来，我还有几分相信。*你个乳臭未干的娃娃，拿命*来！", 184, 0)  --对话
Cls()  --清屏
if WarMain(161, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_37(3)  --增加品德
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(41, 34)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("青青、青青……", 54, 0)  --对话
Cls()  --清屏
TalkEx("袁大哥，我……恐怕不行了*……", 91, 0)  --对话
Cls()  --清屏
if instruct_16(16) then  --是否在队伍
	instruct_37(3)  --增加品德
	TalkEx("我来看看……有我蝶谷医仙*胡青牛在，没有什么不行的*！", 16, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 11,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("青青，你，太好了，你还活*着，我……", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("袁大哥，瞧你哭的像个泪人*一样，让别人看了笑话……", 91, 0)  --对话
	Cls()  --清屏
	TalkEx("啊，是是，呵呵，我……", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("呵呵呵，先生神乎其技，不*愧医仙之名啊！", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("哪里哪里，穆先生过奖了。", 16, 0)  --对话
	Cls()  --清屏
	TalkEx("承志啊，还不快谢过胡前辈*和这位少侠。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("是，两位大恩，袁承志在此*谢过。今后若有任何差遣，*袁某愿赴汤蹈火！", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("袁公子太客气了。*不过，我倒真有件事情想请*穆老前辈和袁公子帮帮我。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("少侠但讲无妨。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("我一直在寻找十四天书，不*知穆老前辈可有线索？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("其他的书我不知道，我这里*有一本《碧血剑》，应该是*你想要的吧。少侠帮我华山*派许多，这本书就赠与少侠*吧。", 185, 0)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	TalkEx("多谢穆老前辈。", 247, 1)  --对话
	Cls()  --清屏
	TalkEx("承志啊，这位少侠帮了你这*么多，我看，今后你就跟着*他，帮他找寻十四天书吧。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("是，弟子谨遵师命。", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("好，少侠手刃玉真子，此次*华山聚会也算功德圆满，大*家就此散了吧。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("少侠，我和青青去小村了，*随时听候少侠差遣。", 54, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(104, 83,1,0,992,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

end
if instruct_16(28) then  --是否在队伍
	instruct_37(3)  --增加品德
	TalkEx("我来看看……有我平一指在*，没有什么不行的！", 28, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 11,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("青青，你，太好了，你还活*着，我……", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("袁大哥，瞧你哭的像个泪人*一样，让别人看了笑话……", 91, 0)  --对话
	Cls()  --清屏
	TalkEx("啊，是是，呵呵，我……", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("呵呵呵，先生神乎其技，老*朽佩服，不过先生号称“杀*人名医”，是不是还要再杀*一人呢？", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("唉，没治好令狐公子，我这*条命早已输给这位少侠了，*“杀人名医”的名号再也不*要提起啦。", 28, 1)  --对话
	Cls()  --清屏
	TalkEx("承志啊，还不快谢过平前辈*和这位少侠。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("是，两位大恩，袁承志在此*谢过。今后若有任何差遣，*袁某愿赴汤蹈火！", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("袁公子太客气了。*不过，我倒真有件事情想请*穆老前辈和袁公子帮帮我。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("少侠但讲无妨。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("我一直在寻找十四天书，不*知穆老前辈可有线索？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("其他的书我不知道，我这里*有一本《碧血剑》，应该是*你想要的吧。少侠帮我华山*派许多，这本书就赠与少侠*吧。", 185, 0)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	TalkEx("多谢穆老前辈。", 247, 1)  --对话
	Cls()  --清屏
	TalkEx("承志啊，这位少侠帮了你这*么多，我看，今后你就跟着*他，帮他找寻十四天书吧。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("是，弟子谨遵师命。", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("好，少侠手刃玉真子，此次*华山聚会也算功德圆满，大*家就此散了吧。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("少侠，我和青青去小村了，*随时听候少侠差遣。", 54, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(104, 83,1,0,992,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件
	Cls()  --清屏

end
if instruct_16(45) then  --是否在队伍
	instruct_37(3)  --增加品德
	TalkEx("我来看看……有我阎王敌薛*慕华在，没有什么不行的！", 45, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 11,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("青青，你，太好了，你还活*着，我……", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("袁大哥，瞧你哭的像个泪人*一样，让别人看了笑话……", 91, 0)  --对话
	Cls()  --清屏
	TalkEx("啊，是是，呵呵，我……", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("呵呵呵，先生神乎其技，不*愧是阎王敌啊！", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("哪里哪里，穆先生过奖了。", 45, 0)  --对话
	Cls()  --清屏
	TalkEx("承志啊，还不快谢过薛前辈*和这位少侠。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("是，两位大恩，袁承志在此*谢过。今后若有任何差遣，*袁某愿赴汤蹈火！", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("袁公子太客气了。*不过，我倒真有件事情想请*穆老前辈和袁公子帮帮我。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("少侠但讲无妨。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("我一直在寻找十四天书，不*知穆老前辈可有线索？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("其他的书我不知道，我这里*有一本《碧血剑》，应该是*你想要的吧。少侠帮我华山*派许多，这本书就赠与少侠*吧。", 185, 0)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	TalkEx("多谢穆老前辈。", 247, 1)  --对话
	Cls()  --清屏
	TalkEx("承志啊，这位少侠帮了你这*么多，我看，今后你就跟着*他，帮他找寻十四天书吧。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("是，弟子谨遵师命。", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("好，少侠手刃玉真子，此次*华山聚会也算功德圆满，大*家就此散了吧。", 185, 0)  --对话
	Cls()  --清屏
	TalkEx("少侠，我和青青去小村了，*随时听候少侠差遣。", 54, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(104, 83,1,0,992,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("青青，你不会有事的……", 54, 0)  --对话
Cls()  --清屏
TalkEx("袁大哥，能认识你，我很开*心，真的很开心……", 91, 0)  --对话
Cls()  --清屏
TalkEx("青青，青青……", 54, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,1,0,0,0,0,6700,6700,6700,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,0,0,0,6696,6696,6696,-2,-2,-2)  --修改场景事件
instruct_3(80, 13,0,0,0,0,0,7064,7064,7064,-2,-2,-2)  --修改场景事件
instruct_3(80, 12,0,0,0,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
instruct_19(22, 18)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
instruct_25(20,15,20,15)  --场景移动
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("承志啊，人死不能复生，你*还是节哀吧。", 185, 0)  --对话
Cls()  --清屏
TalkEx("我……师父，弟子想一个人*静一静……我……我……", 54, 0)  --对话
Cls()  --清屏
TalkEx("孩子，你不要总想这件事了*，到处去游历一番，痛苦会*随着时间慢慢减轻。活着的*人，总是要好好活下去的…*…", 185, 0)  --对话
Cls()  --清屏
TalkEx("弟子……遵命……", 54, 0)  --对话
Cls()  --清屏
TalkEx("袁公子……", 244, 1)  --对话
Cls()  --清屏
TalkEx("人生不如意，十有八九啊…*…", 185, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(78, 0,1,0,347,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
