TalkEx("袁公子，真没想到在这遇见*你。", 247, 1)  --对话
Cls()  --清屏
TalkEx("原来是你啊，我正要去找你*呢。", 54, 0)  --对话
Cls()  --清屏
TalkEx("找我？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是啊，我这些年到处游历，*无意中发现了一本奇书《碧*血剑》，我想可能就是你要*寻找的天书之一吧。", 54, 0)  --对话
Cls()  --清屏
TalkEx("太好了，这正是我要找的书*！", 0, 1)  --对话
Cls()  --清屏
if instruct_28(0,75,999) then --判断品德是否在范围之内
	instruct_37(1)  --增加品德
	TalkEx("既然如此，这本书就送给你*吧。", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("哈哈，太好了，多谢袁公子！", 247, 1)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	TalkEx("看到你高兴的样子，我的心*也再度活跃起来。", 54, 0)  --对话
	Cls()  --清屏
	TalkEx("那袁公子何不与我一同闯荡*江湖？", 0, 1)  --对话
	Cls()  --清屏
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		TalkEx("好，愿陪少侠走一遭！", 54, 0)  --对话
		Cls()  --清屏
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		instruct_10(54)  --加入队伍
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去*小村吧。", 54, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("不过少侠近来在江湖上似乎*做了不少不道德的事情啊…*…", 54, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,348,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
