instruct_30(49,36,45,36)  --人物移动
instruct_30(45,36,45,33)  --人物移动
instruct_30(45,33,39,33)  --人物移动
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_37(-5)  --增加品德
TalkEx("??，华山派的人都在啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx("兄台，是你啊。", 54, 0)  --对话
Cls()  --清屏
TalkEx("姓袁的，我明人不作暗事，*你不用跟我称兄道弟，过去*的交情一笔勾销。我今日来*此，是要为金龙帮报仇的。", 245, 1)  --对话
Cls()  --清屏
TalkEx("金龙帮的事，是我做的，与*小师叔无关。我们应闵二爷*之邀，为他大哥报仇。这和*阁下有什么关系？", 183, 0)  --对话
Cls()  --清屏
TalkEx("你甭管我和金龙帮是什么关*系！反正我今日来，就是要*为金龙帮报仇，华山派的人*，一个也活不了！", 245, 1)  --对话
Cls()  --清屏
TalkEx("华山乃清修之所，岂容你这*恶徒胡作非为！", 185, 0)  --对话
Cls()  --清屏
if WarMain(165, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 4,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,1,0,0,0,0,5436,5436,5436,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(59, 14,1,0,358,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
