--重写使用唐诗选集的事件
--OEVENTLUA[45] = function()

  if instruct_4(206,0,331) ==true then    --  4(4):是否使用物品[唐诗选集]？否则跳转到:Label0
  
  		Talk("咦，有字显示出来了", 0);		--[主角]：咦，有字显示出来了
  		if not inteam(37) then
  			Talk("似乎只有狄兄弟才能理解这其中的意思", 0);	--[主角]：似乎只有狄兄弟才能理解这其中的意思
  			return;
  		end
  		Talk("连城诀……天宁寺大佛后……", 37);		--[狄云]：连城诀……天宁寺大佛后……
  		Talk("终于有天书的下落了，我们赶紧过去看看吧", 0);		--[主角]：终于有天书的下落了，我们赶紧过去看看吧
  		Talk("似乎还有一个类似剑谱的东西", 0);		--[主角]：似乎还有一个类似剑谱的东西
  			
  		Cls();
			local x = CC.ScreenW/2;
			local y = CC.ScreenH/2;
			local color = C_GOLD;
			local size = CC.Fontbig;
			local offx = (#"床前明月光，疑是地上霜" - #"静夜思")*size/4;
			
			DrawString(x+offx,y,"静夜思",color,size);  --静夜思
			ShowScreen();
			lib.Delay(1000);
			DrawString(x,y+size,"床前明月光，疑是地上霜",color,size);  --床前明月光，疑是地上霜
			ShowScreen();
			lib.Delay(1000);
			DrawString(x,y+size*2,"举头望明月，低头思故乡",color,size);  --举头望明月，低头思故乡
			ShowScreen();
			lib.Delay(2000);
			
			
			Talk("是连城剑诀，没想到竟然在这唐诗之中", 37);		--[狄云]：是连城剑诀，没想到竟然在这唐诗之中
			instruct_35(37,1,114,0);		--狄云第二武功洗为连城剑法
			DrawStrBoxWaitKey(string.format("%s 学会武功 %s", JY.Person[37]["姓名"], JY.Wugong[114]["名称"]), C_ORANGE, CC.DefaultFont)
			instruct_2(237,1);		--得到连城剑诀
			
  		
      instruct_3(3,5,1,0,644,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [5]
      instruct_3(3,6,1,0,644,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [6]
      instruct_3(3,8,1,0,644,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [8]
      instruct_3(-2,5,1,0,44,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
      instruct_3(63,17,0,0,0,0,48,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [17]
      instruct_3(-2,-2,1,0,47,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
      instruct_32(206,-1);   --  32(20):物品[唐诗选集]+[-1]
      instruct_3(63,1,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [1]
      instruct_3(63,2,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [2]
      instruct_3(63,3,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [3]
      instruct_3(63,4,0,0,0,0,0,6766,6766,6766,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [4]
      instruct_3(63,5,0,0,0,0,0,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [5]
      instruct_3(63,6,0,0,0,0,0,6770,6770,6770,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [6]
      instruct_3(63,7,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [7]
      instruct_3(63,8,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [8]
      instruct_3(63,9,0,0,0,0,0,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [9]
      instruct_3(63,10,0,0,0,0,0,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [10]
      instruct_3(63,11,0,0,0,0,0,6780,6780,6780,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [11]
      instruct_3(63,12,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [12]
      instruct_3(63,13,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [13]
      instruct_3(63,14,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [14]
      instruct_3(63,15,0,0,0,0,0,5222,5222,5222,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [15]
      instruct_3(63,16,0,0,0,0,0,6768,6768,6768,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [16]
      instruct_3(63,18,1,0,49,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[天宁寺]:场景事件编号 [18]
      do return; end
  end    --:Label0

  instruct_0();   --  0(0)::空语句(清屏)
--end