instruct_14()  --场景变黑
instruct_37(2)  --增加品德
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(34,20,30,21)  --场景移动
TalkEx("妹子，你在这里练功夫么？", 61, 0)  --对话
Cls()  --清屏
TalkEx("＜靖哥哥受了重伤，还需五*天五夜方能痊愈。偏巧在这*时候碰见这个姓欧阳的，真*是倒霉，怎生撒个大谎，将*他远远骗走＞", 56, 0)  --对话
Cls()  --清屏
TalkEx("妹子，出来罢，躲在这里气*闷得紧。我知道那姓郭的小*子已经深受重伤，妹子，你*就依了我吧，咱俩做个长久*夫妻。只要你答应我，我保*证不加害这个姓郭的小子。", 61, 0)  --对话
Cls()  --清屏
TalkEx("＜不好，郭大哥和黄姑娘有*难，我得帮帮他们＞，欧阳*兄，好久不见啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊？又是你！", 61, 0)  --对话
Cls()  --清屏
TalkEx("小兄弟你来得正好，快来结*果了这个恶人。", 56, 0)  --对话
Cls()  --清屏
TalkEx("听见了吗？欧阳克，你作恶*多端，今日我就要送你归西*！", 245, 1)  --对话
Cls()  --清屏
if WarMain(178, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 1,1,0,0,0,0,5154,5154,5154,-2,-2,-2)  --修改场景事件
instruct_19(30, 21)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(2)  --增加品德
TalkEx("多亏小兄弟及时赶到，否则*今日定难逃脱", 56, 0)  --对话
Cls()  --清屏
TalkEx("郭大哥怎么了？好像伤得很*严重！", 0, 1)  --对话
Cls()  --清屏
TalkEx("靖哥哥和我得知金人要偷武*穆遗书，我们就连夜赶到皇*宫保护，没想到西毒欧阳锋*竟然帮着金人，以蛤蟆功掌*力震伤靖哥哥。", 56, 0)  --对话
Cls()  --清屏
TalkEx("可恶的西毒欧阳锋，教我碰*见一定好好教训他！", 245, 1)  --对话
Cls()  --清屏
TalkEx("谁这么大口气！", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 6,0,0,0,0,0,8218,8218,8218,-2,-2,-2)  --修改场景事件
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("啊，克儿，你怎么了？克儿*！谁，是谁杀了克儿！是不*是你！", 60, 0)  --对话
Cls()  --清屏
TalkEx("＜完了，没办法，事到如今*，豁出去了！＞就是我，怎*么样！", 245, 1)  --对话
Cls()  --清屏
TalkEx("好小子，有骨气！拿命来吧*！", 60, 0)  --对话
Cls()  --清屏
instruct_47(60,30)  --增加攻击力
if WarMain(172, 1) == false then  --战斗开始
	Cls()  --清屏

end
instruct_3(-2, 7,0,0,0,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("嘿嘿，臭蛤蟆，在练什么功*夫啊？", 64, 0)  --对话
Cls()  --清屏
TalkEx("周老爷子，别在一旁看热闹*，快来帮帮我", 0, 1)  --对话
Cls()  --清屏
TalkEx("放心，有我在，老毒物伤不*了你。", 64, 0)  --对话
Cls()  --清屏
instruct_47(60,30)  --增加攻击力
if WarMain(173, 1) == false then  --战斗开始
	Cls()  --清屏

end
instruct_3(-2, 8,0,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("蓉儿，是你吗？", 57, 0)  --对话
Cls()  --清屏
TalkEx("爹爹，快过来，老毒物欺负*你女儿！", 56, 0)  --对话
Cls()  --清屏
TalkEx("锋兄，为何动手啊？", 57, 0)  --对话
Cls()  --清屏
TalkEx("欧阳克要欺负我，正好小兄*弟赶到，杀了欧阳克，老毒*物要为他侄子报仇，爹爹，*你快帮帮这位小兄弟吧！", 56, 0)  --对话
Cls()  --清屏
TalkEx("锋兄，你那侄子也可算是作*恶多端死有余辜，你何必…*…", 57, 0)  --对话
Cls()  --清屏
TalkEx("废话少说，我今日定要为克*儿报仇！", 60, 0)  --对话
Cls()  --清屏
instruct_47(60,30)  --增加攻击力
if WarMain(174, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("好小子，算你命大，我就让*你再多活几天！克儿，你放*心，等叔叔练好了九阴真经*，一定为你报仇！", 60, 0)  --对话
Cls()  --清屏
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
TalkEx("多谢周老前辈、黄岛主的救命*之恩！", 0, 1)  --对话
Cls()  --清屏
TalkEx("你救了蓉儿，我救了你，咱*们两不相欠，不必言谢。", 57, 0)  --对话
Cls()  --清屏
TalkEx("黄老邪，你这话就不对了。*就算你不来，我一样可以把*欧阳锋打跑。所以说你来根*本就是多余，小兄弟也不是*你救的。可是他救你女儿女*婿却是实实在在的，所以你*还是欠他的。", 64, 0)  --对话
Cls()  --清屏
TalkEx("我黄药师一生从不欠别人的*。这样吧，小友，我就把我*的生平绝学传授与你吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("岛主救我性命，我已然感激*不尽，若再接受岛主传艺，*实在惶恐。", 0, 1)  --对话
Cls()  --清屏
TalkEx("小友不必过谦。我一身武艺*，本想有个传人。怎奈我当*初一怒之下，把我所有的徒*弟都逐出门墙。如今得了个*女婿，又是如此……", 57, 0)  --对话
Cls()  --清屏
TalkEx("爹——", 56, 0)  --对话
Cls()  --清屏
TalkEx("哼，说你的靖哥哥几句你就*不高兴！小友，我看你天资*聪颖，与我桃花岛又颇有缘*分，趁着靖儿养伤这几日，*我这弹指神通的功夫就传给*你吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("多谢岛主厚爱，恭敬不如从*命。", 247, 1)  --对话
Cls()  --清屏
TalkEx("黄老邪，你以为你了不起，*什么生平绝学弹指神通！我*周伯通别的功夫都想学，就*是不看你的古怪功夫。我去*也！", 64, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
instruct_19(23, 35)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("靖儿的伤已经痊愈了，我这*弹指神通的功夫，小友也学*得差不多啦，咱们就此别过*。", 57, 0)  --对话
Cls()  --清屏
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
TalkEx("爹——*唉，这么快就走，一点也不*疼女儿！", 56, 0)  --对话
Cls()  --清屏
TalkEx("郭大哥，黄姑娘，你们有何*打算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我要继续寻访武穆遗书的下*落。", 55, 0)  --对话
Cls()  --清屏
TalkEx("小兄弟，咱们就此别过！", 56, 0)  --对话
Cls()  --清屏
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(48, 3,0,0,0,0,469,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(48, 2,0,0,0,0,469,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(48, 20,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(48, 21,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(48, 22,0,0,0,0,0,7988,7988,7988,-2,-2,-2)  --修改场景事件
instruct_3(48, 26,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  --修改场景事件
instruct_3(48, 25,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_2(95, 1)  --得到或失去物品
Cls()  --清屏
do return end
