if instruct_16(1) == false then  --是否在队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_14()  --场景变黑
instruct_37(2)  --增加品德
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(3, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(24, 11,1,0,6,0,0,7012,7012,7012,-2,-2,-2)  --修改场景事件
instruct_3(24, 1,1,0,6,0,0,5212,5212,5212,-2,-2,-2)  --修改场景事件
instruct_3(24, 2,1,0,0,0,0,5224,524,5224,-2,-2,-2)  --修改场景事件
instruct_3(24, 3,1,0,0,0,0,5224,5224,5224,-2,-2,-2)  --修改场景事件
instruct_3(24, 4,1,0,0,0,0,5220,5220,5220,-2,-2,-2)  --修改场景事件
instruct_3(24, 5,1,0,0,0,0,5220,5220,5220,-2,-2,-2)  --修改场景事件
instruct_3(24, 6,1,0,0,0,0,5222,5222,5222,-2,-2,-2)  --修改场景事件
instruct_3(24, 7,1,0,0,0,0,5218,5218,5218,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
Cls()  --清屏
instruct_30(41,31,36,31)  --人物移动
Cls()  --清屏
instruct_25(31,31,34,31)  --场景移动
Cls()  --清屏
TalkEx("你们是田归农请来的吧！神*龙教何时跟田归农搭在一起*了．", 3, 0)  --对话
Cls()  --清屏
TalkEx("还多亏了田兄，我们才知道*\"飞狐外传\"一书在你这．识*相的话就快将书交出来．", 203, 0)  --对话
Cls()  --清屏
TalkEx("田归农呢？他怎麽不敢出来*见我．", 3, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿，苗兄，好久不见，别*来无恙乎？", 72, 0)  --对话
Cls()  --清屏
TalkEx("姓田的，亏你还有脸来见我*！", 3, 0)  --对话
Cls()  --清屏
TalkEx("苗兄，何必这么大的火气，*伤了你我兄弟的和气。", 72, 0)  --对话
Cls()  --清屏
TalkEx("……**她还好吗？……", 3, 0)  --对话
Cls()  --清屏
TalkEx("我看你是见不到她了．这药*是从毒手药王那弄来的断肠*草粉末，药效也真够狠，现*下你双眼已瞎，我看\"打遍*天下无敌手\"的金面佛苗人*凤，今日要上西天了，兄弟*们，上！", 72, 0)  --对话
Cls()  --清屏
TalkEx("苗大侠，我帮你拿贼。", 245, 1)  --对话
Cls()  --清屏
if WarMain(3, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(24, 11,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 4,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 5,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 6,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 7,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("小兄弟，你尊姓大名，与我*可有渊源？", 3, 0)  --对话
Cls()  --清屏
TalkEx("丈夫结交，但重义气，*只需肝胆相照，何必提名道*姓。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，苗人凤独来独往，生平*只有两个知交，一个是辽东*大侠胡一刀，另一个便是你*这位不知姓名没见过面的小*兄弟。", 3, 0)  --对话
Cls()  --清屏
TalkEx("你说什麽。那你为何要杀死*胡大侠。", 1, 1)  --对话
Cls()  --清屏
TalkEx("这说来话长……", 3, 0)  --对话
Cls()  --清屏
TalkEx("大哥，*我们先想办法救苗大侠，*这事以後再说。", 0, 1)  --对话
Cls()  --清屏
TalkEx("苗大侠，既然这药是毒手药*王所配制，那我们去求毒手*药王救治，或能解得。", 0, 1)  --对话
Cls()  --清屏
TalkEx("要求毒手药王吗？那是徒劳*往返，不用去了。", 3, 0)  --对话
Cls()  --清屏
TalkEx("不，天下无难事！这位毒手*药王住在那里？", 0, 1)  --对话
Cls()  --清屏
TalkEx("听说此人在洞庭湖畔隐居。", 3, 0)  --对话
Cls()  --清屏
TalkEx("我这就去了！", 0, 1)  --对话
Cls()  --清屏
TalkEx("苗大侠，你要照顾好自己，*等我从毒手药王那求取到解*药回来帮你医治。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, 9,0,0,0,0,7,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(49, 2,1,0,8,0,0,5210,5210,5210,-2,-2,-2)  --修改场景事件
instruct_3(3, 9,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 12,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 11,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 10,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
