instruct_14()  --场景变黑
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
TalkEx("好像西毒已经来给欧阳克提*亲了，我赶紧过去看看。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 1,1,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,7970,7970,7970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_19(34, 23)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("药兄，别来无恙？", 60, 0)  --对话
Cls()  --清屏
TalkEx("锋兄，久违了。", 57, 0)  --对话
Cls()  --清屏
TalkEx("黄老哥，真有你的，这般美*貌的小姑娘也亏你生得出来*。这颗\"通犀地龙丸\"得自西*域异兽之体，并经我配以药*材制炼过，服用之后，百毒*不侵，普天下就只这一颗而*已。以后你做了我侄媳妇，*不用害怕你叔公的诸般毒蛇*毒虫。", 60, 0)  --对话
Cls()  --清屏
TalkEx("多谢您啦！着！", 56, 0)  --对话
Cls()  --清屏
TalkEx("哎呦！", 61, 0)  --对话
Cls()  --清屏
TalkEx("干甚么？", 57, 0)  --对话
Cls()  --清屏
TalkEx("爹爹你打死我最好，反正我*宁可死了，也不嫁这坏东西*。", 56, 0)  --对话
Cls()  --清屏
TalkEx("说得好！", 69, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 27,0,0,0,0,0,6124,6124,6124,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("师父，师父。", 56, 0)  --对话
Cls()  --清屏
TalkEx("药兄，老叫化不请自来啊。", 69, 0)  --对话
Cls()  --清屏
TalkEx("哪里哪里，七公大驾光临，*蓬荜生辉啊。蓉儿，你叫七*公做什么？", 57, 0)  --对话
Cls()  --清屏
TalkEx("我拜了七公他老人家为师。", 56, 0)  --对话
Cls()  --清屏
TalkEx("七兄青眼有加，兄弟感激不*尽，只是小女胡闹顽皮，还*盼七兄多加管教。", 57, 0)  --对话
Cls()  --清屏
TalkEx("药兄家传武学，博大精深，*这小妮子一辈子也学不了，*又怎用得着我来多事？不瞒*你说，我收她为徒，其志在*于吃白食，骗她时时烧些好*菜给我吃，你也不用谢我。", 69, 0)  --对话
Cls()  --清屏
TalkEx("呵呵呵，七兄，大驾光临桃*花岛，不知有何贵干。", 57, 0)  --对话
Cls()  --清屏
TalkEx("我来向你求一件事。只怕这*件事不易办。", 69, 0)  --对话
Cls()  --清屏
TalkEx("若是易办之事，七兄也想不*到小弟了。只要七兄一句话*，火里火里去，水里水里去*！", 57, 0)  --对话
Cls()  --清屏
TalkEx("这两个都是我徒儿，我已答*允他们，要向药兄恳求，让*他们成亲。", 69, 0)  --对话
Cls()  --清屏
TalkEx("啊？", 57, 0)  --对话
Cls()  --清屏
TalkEx("七兄，你此言差矣！药兄的*千金早已许配舍侄，今日兄*弟就是到桃花岛来行纳币文*定之礼的。", 60, 0)  --对话
Cls()  --清屏
TalkEx("黄老邪，现今你一女许配两*家，你看怎么办吧？", 69, 0)  --对话
Cls()  --清屏
TalkEx("这倒教兄弟好生为难，只得*出三个题目，考两位世兄一*考。哪一位高才捷学，小女*就许配于他，兄弟决不偏袒*。两个老友瞧着好也不好？", 57, 0)  --对话
Cls()  --清屏
TalkEx("我就知道黄老邪花样多，快*说来听听。", 69, 0)  --对话
Cls()  --清屏
TalkEx("这第一道考题嘛，自然是比*武。可是他二人都志在争夺*小女，若是动手，必然伤了*和气。", 57, 0)  --对话
Cls()  --清屏
TalkEx("呵呵，看来是你这位岳父大*人要亲自试试未来女婿的功*夫了。", 60, 0)  --对话
Cls()  --清屏
TalkEx("不然，如果我亲自出手，难*免不会有人说我偏心。需得*找一位局外之人，这样吧，*就由这位小兄弟代劳吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("啊，我？", 0, 1)  --对话
Cls()  --清屏
TalkEx("对，我见你功夫不弱，又是*此间唯一的局外之人。由你*分别和他二人比试，七兄、*锋兄与我共同做裁判。我不*会让你白做的。怎么样？开*始吧。", 57, 0)  --对话
Cls()  --清屏
if WarMain(77, 1) == false then  --战斗开始
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
if WarMain(76, 1) == false then  --战斗开始
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("各位观众，现在\"超级男生\"*的争夺战已经进入白热化，*现在走上PK台的是北丐之徒*郭靖和西毒之侄欧阳克。我*们来听一下各位评审老师的*点评。首先是洪老师。", 56, 0)  --对话
Cls()  --清屏
TalkEx("靖儿，如果你不练武，那将*是中国武坛的损失！", 69, 0)  --对话
Cls()  --清屏
TalkEx("接下来是欧阳老师。", 56, 0)  --对话
Cls()  --清屏
TalkEx("克儿的基础很好，一看就知*道是名师指点。", 60, 0)  --对话
Cls()  --清屏
TalkEx("接下来是黄老师。", 56, 0)  --对话
Cls()  --清屏
TalkEx("二位贤侄表现都不错……", 57, 0)  --对话
Cls()  --清屏
TalkEx("那么，评审团最后的决定是*……好，有结果出来了——*郭靖！恭喜靖哥哥成功闯过*第一关。我可是最忠实的\"*锅巴\"呦！让我一起大声的*为靖哥哥加油，\"郭靖郭靖*，脑筋不灵，刻苦用功，终*会成名！\"", 56, 0)  --对话
Cls()  --清屏
TalkEx("这第一场比试是郭贤侄胜了*。接下来是第二场，我以音*律考教两位。两位贤侄各折*一根竹枝，敲击我箫声的节*拍，瞧谁打得好，谁就胜这*第二场。", 57, 0)  --对话
Cls()  --清屏
TalkEx("黄药师吹奏一曲碧海潮声曲*，欧阳克可以打对节拍，郭*靖竟可与箫声相抗，不禁令*人称奇。", 57, 2)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("论内功是郭贤侄强些，但我*刚才考的是音律，那却是欧*阳贤侄高明得多了……这样*罢，这一场两人算是平手。*我再出一道题目，让两位贤*侄一决胜负。", 57, 0)  --对话
Cls()  --清屏
TalkEx("对，对，再比一场。", 60, 0)  --对话
Cls()  --清屏
TalkEx("这本册子是拙荆当年所手书*，乃她心血所寄，现下请两*位贤侄同时阅读一遍，然后*背诵出来，谁背得又多又不*错，我就把女儿许配于他。", 57, 0)  --对话
Cls()  --清屏
TalkEx("黄老邪，谁听你鬼话连篇？*你明知我徒儿傻气，不通诗*书，却来考他背书。", 69, 0)  --对话
Cls()  --清屏
TalkEx("黄岛主，师父，弟子与欧阳*大哥比试一下背书就是。弟*子资质鲁钝，输了也是该的*。", 55, 0)  --对话
Cls()  --清屏
TalkEx("好哇！你爱丢丑，只管现眼*就是，请啊，请啊！", 69, 0)  --对话
Cls()  --清屏
TalkEx("好，那么现在开始。", 57, 0)  --对话
Cls()  --清屏
TalkEx("＜咦，这，这……怎么和周*大哥教我背的一模一样，嗯*……周大哥教我背的还要更*多些……＞", 55, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("那么小侄先背了……", 61, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("不错，仓卒之间，难得你背*得这许多，郭贤侄，该你了*。", 57, 0)  --对话
Cls()  --清屏
TalkEx("天之道，损有余而补不足，*是故虚胜实，不足胜有余…*…", 55, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("梅超风失落的《九阴真经》*，可是到了你的手中？", 57, 0)  --对话
Cls()  --清屏
TalkEx("没有啊……", 55, 0)  --对话
Cls()  --清屏
TalkEx("郭贤侄，这《九阴真经》的*经文，你是从何处学来的？", 60, 0)  --对话
Cls()  --清屏
TalkEx("我背的是《九阴真经》？不*对，不是的。那是周大哥教*我背的，是他自创的武功秘*诀。", 55, 0)  --对话
Cls()  --清屏
TalkEx("你说老顽童周伯通？你怎地*叫他大哥？", 69, 0)  --对话
Cls()  --清屏
TalkEx("这个，我，周大哥非要和我*结拜……", 55, 0)  --对话
Cls()  --清屏
TalkEx("一老一小，胡闹胡闹", 69, 0)  --对话
Cls()  --清屏
TalkEx("那周伯通现在哪里？", 60, 0)  --对话
Cls()  --清屏
TalkEx("周伯通就在桃花岛！", 57, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,8218,8218,8218,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,8000,8000,8000,-2,-2,-2)  --修改场景事件
instruct_19(9, 31)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("周伯通，你手里怎么还有九*阴真经的下卷？", 57, 0)  --对话
Cls()  --清屏
TalkEx("本来呢是没有的，可是你的*傻女婿给我送来了。", 64, 0)  --对话
Cls()  --清屏
TalkEx("姓郭的，你怎么说不知道", 57, 0)  --对话
Cls()  --清屏
TalkEx("我真是不知啊", 55, 0)  --对话
Cls()  --清屏
TalkEx("你怎么不知？你说亲手从梅*超风那里抢来，幸亏黄药师*那老头儿不知道。你还说学*通了经书之后，从此天下无*敌。", 64, 0)  --对话
Cls()  --清屏
TalkEx("大哥，我……我几时说过？*岳父……", 55, 0)  --对话
Cls()  --清屏
TalkEx("你这狡诈贪得的小子，谁是*你的岳父？今后你再踏上桃*花岛一步，休怪黄某无情。*你们都走吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("＜看来想取得九阴真经，就*要从周伯通和姓郭的这傻小*子身上下手＞，七兄，周兄*，坐兄弟的船走吧。", 60, 0)  --对话
Cls()  --清屏
TalkEx("我怕蛇，我不坐老毒物的船*。黄老邪，我要坐那艘大船*。", 64, 0)  --对话
Cls()  --清屏
TalkEx("这船最不吉利，坐了的人非*病即灾，是以停泊在这里向*来不用的。你若不信，我马*上把船烧了给你看。", 57, 0)  --对话
Cls()  --清屏
TalkEx("我要坐新船，我要坐新船。", 64, 0)  --对话
Cls()  --清屏
TalkEx("药兄，老叫化一生不吉利，*就陪老顽童坐坐这艘凶船，*咱们来个以毒攻毒，斗它一*斗，瞧是老叫化的晦气重些*呢，还是你这艘凶船厉害。", 69, 0)  --对话
Cls()  --清屏
TalkEx("黄某不敢相欺，坐这艘船实*在凶多吉少。两位实不必甘*冒奇险。只是此中原由，不*便明言。", 57, 0)  --对话
Cls()  --清屏
TalkEx("你已一再有言在先，老叫化*若是晕船归天，仍是赞你药*兄够朋友。", 69, 0)  --对话
Cls()  --清屏
TalkEx("两位功夫高强，想来必能逢*凶化吉，黄某倒是多虑了。*姓郭的小子，你也去罢。这*位少侠，你刚才帮了黄某的*忙，这套落英神剑掌就传授*给你吧。", 57, 0)  --对话
Cls()  --清屏
instruct_2(101, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("你们都走吧，都走吧，桃花*岛不欢迎任何人！", 57, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(98, 16,1,0,503,0,0,7970,7970,7970,-2,-2,-2)  --修改场景事件
instruct_3(98, 14,1,0,0,0,0,5154,5154,5154,-2,-2,-2)  --修改场景事件
instruct_19(34, 43)  --设置人物XY坐标
Cls()  --清屏
instruct_13()  --场景变亮
instruct_39(10)  --打开场景
do return end
