instruct_37(-3)  --增加品德
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_37(-2)  --增加品德
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(34,20,30,21)  --场景移动
TalkEx("妹子，你在这里练功夫么？", 61, 0)  --对话
Cls()  --清屏
TalkEx("＜靖哥哥受了重伤，还需五*天五夜方能痊愈。偏巧在这*时候碰见这个姓欧阳的，真*是倒霉，怎生撒个大谎，将*他远远骗走＞", 56, 0)  --对话
Cls()  --清屏
TalkEx("妹子，出来罢，躲在这里气*闷得紧。我知道那姓郭的小*子已经深受重伤，妹子，你*就依了我吧，咱俩做个长久*夫妻。只要你答应我，我保*证不加害这个姓郭的小子。", 61, 0)  --对话
Cls()  --清屏
TalkEx("＜郭靖，黄蓉，还有欧阳克*，他们在做什么？＞，欧阳*兄，好久不见啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是你啊，来得正好，帮我解*决这个姓郭的！", 61, 0)  --对话
Cls()  --清屏
TalkEx("小子，你想知道《射雕英雄*传》的下落吗？帮我打发了*这只小蛤蟆，我就告诉你。", 56, 0)  --对话
Cls()  --清屏
TalkEx("＜莫非她真的知道？我该怎*么办？一边是北丐的徒弟，*东邪的女儿，一边是西毒的*侄子，我到底该帮谁呢？＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("这《射雕英雄传》的下落只*有我爹知道，你要是不救我*，就再也别想拿到啦！", 56, 0)  --对话
Cls()  --清屏
TalkEx("＜没办法，还是拿书重要＞*，欧阳克，你作恶多端，今*日我就要送你归西！", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊，兄弟，你？！", 61, 0)  --对话
Cls()  --清屏
if WarMain(178, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 1,1,0,0,0,0,5154,5154,5154,-2,-2,-2)  --修改场景事件
instruct_19(30, 21)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("多谢兄弟救命之恩。", 55, 0)  --对话
Cls()  --清屏
TalkEx("靖哥哥，你不用谢他，他还*不是为了《射雕英雄传》！", 56, 0)  --对话
Cls()  --清屏
TalkEx("既然你都知道，那就告诉我*！", 0, 0)  --对话
Cls()  --清屏
TalkEx("什么人大胆，敢逼问我黄老*邪的女儿！", 57, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 8,0,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("＜不好，黄老邪来了＞，黄*岛主误会了，刚刚我还为了*救令爱，亲手杀死欧阳克！", 247, 1)  --对话
Cls()  --清屏
TalkEx("蓉儿，可有此事？", 57, 0)  --对话
Cls()  --清屏
TalkEx("是他救的不假。不过他是为*了《射雕英雄传》！", 56, 0)  --对话
Cls()  --清屏
TalkEx("《射雕英雄传》？我也听说*有这样一本奇书，可没有人*知道在哪里！", 57, 0)  --对话
Cls()  --清屏
TalkEx("啊？难道黄岛主不知道？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我曾听中神通重阳真人提起*过此书。自从重阳真人仙去*之后，再无人知晓！", 57, 0)  --对话
Cls()  --清屏
TalkEx("黄姑娘，你不是说……", 0, 1)  --对话
Cls()  --清屏
TalkEx("对啊，我说我爹知道，我爹*的确听重阳真人说起过，怎*么样？", 56, 0)  --对话
Cls()  --清屏
TalkEx("你——＜又上了这鬼丫头的*当，这下可是得罪西毒了，*唉……＞", 245, 1)  --对话
Cls()  --清屏
TalkEx("蓉儿，靖儿怎么了？", 57, 0)  --对话
Cls()  --清屏
TalkEx("靖哥哥和我得知金人要偷武*穆遗书，我们就连夜赶到皇*宫保护，没想到西毒欧阳锋*竟然帮着金人，以蛤蟆功掌*力震伤靖哥哥。", 56, 0)  --对话
Cls()  --清屏
TalkEx("既然如此，就回桃花岛养伤*吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("那再好也没有，快走吧。", 56, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("＜此地不宜久留，我得赶快*走＞！", 0, 1)  --对话
Cls()  --清屏
TalkEx("小子，哪里走！", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 6,0,0,0,0,0,8218,8218,8218,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("＜倒霉真倒霉，债主来了！＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊，克儿，你怎么了？克儿*！谁，是谁杀了克儿！是不*是你！", 60, 0)  --对话
Cls()  --清屏
TalkEx("＜完了，怎么办，总不能直*接承认是我干得呀？＞这个*，这个，是，是，是黄药师*!", 247, 1)  --对话
Cls()  --清屏
TalkEx("黄药师为什么要杀我的克儿*？", 60, 0)  --对话
Cls()  --清屏
TalkEx("＜谎话编到底吧＞，是这样*的，郭靖不知怎么受了重伤*，黄蓉正在此为他疗伤。你*侄儿看见后，欲伤害郭靖，*他想和黄姑娘……恩，那个*，正好黄药师赶到，就杀死*了你的侄儿。", 0, 1)  --对话
Cls()  --清屏
TalkEx("此话当真？", 60, 0)  --对话
Cls()  --清屏
TalkEx("千真万确。我路过此地，全*都看在眼里。我与欧阳兄是*莫逆之交，本想上前相助，*可是以我这微末的武功，怎*么能是黄老邪的对手呢？所*以等他们走后才敢出来，准*备装殓欧阳兄的尸身。", 244, 1)  --对话
Cls()  --清屏
TalkEx("＜郭靖的确被我掌力震伤，*我那克儿一直喜欢黄老邪的*丫头，克儿身上所受的伤似*乎的确是桃花岛的武功，看*来这小子所言不虚＞，克儿*，我的克儿，我本想把我一*身武功都传授给你，没想到*你这么早就走了，黄老邪，*你等着！", 60, 0)  --对话
Cls()  --清屏
TalkEx("＜欧阳克已死，欧阳锋的武*功没了传人，正是我的好机*会呀＞，欧阳先生，我也想*为令侄报仇，怎奈我武功低*微，难以如愿，求欧阳先生*收我为徒。", 0, 1)  --对话
Cls()  --清屏
TalkEx("收你为徒也未尝不可，不过*你要先替我办件事。", 60, 0)  --对话
Cls()  --清屏
TalkEx("欧阳先生但有所差，晚辈定*当效劳。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你去铁掌山找裘千仞，就说*是我让你去的，他自然就知*道了。", 60, 0)  --对话
Cls()  --清屏
TalkEx("铁掌水上飘裘千仞？", 0, 1)  --对话
Cls()  --清屏
TalkEx("没错，他的铁掌十分有用，*嘿嘿，你去找他吧。", 60, 0)  --对话
Cls()  --清屏
TalkEx("有用？？", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(48, 0,1,0,505,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
