instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
TalkEx("晚辈参见裘帮主", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是谁，来此何干？", 67, 0)  --对话
Cls()  --清屏
TalkEx("是西域白驼山主人欧阳先生*叫我来的，他说来了您自然*知道。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦，是欧阳先生啊，我知道*我知道。", 67, 0)  --对话
Cls()  --清屏
TalkEx("＜他的表情怎么这么奇怪？*＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("＜欧阳锋和我约好，找一个*能承受住我铁掌的人，打伤*之后让他去找段皇爷治伤，*耗损其功力，以便趁机除掉*段皇爷。不过前几日我已打*伤黄蓉，段皇爷应该已经出*手治伤了，这个小子……＞", 67, 0)  --对话
Cls()  --清屏
TalkEx("欧阳先生大赞裘帮主的铁掌*天下无双，而且说对晚辈十*分有用，不知……", 247, 1)  --对话
Cls()  --清屏
TalkEx("＜可怜的小子，被欧阳锋卖*了还不知道。不过，假他的*手除掉段皇爷也好……＞你*说什么？铁掌？呵呵，自然*有用。你可知道南帝段皇爷*？", 67, 0)  --对话
Cls()  --清屏
TalkEx("天下五绝，如雷贯耳。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我把铁掌功夫传授给你，你*去帮我杀了段皇爷", 67, 0)  --对话
Cls()  --清屏
TalkEx("啊？这个，晚辈如何是段皇*爷的对手？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你放心，他现在应该已经内*力全失了，你只要能打发了*他的几个护卫就行了。", 67, 0)  --对话
Cls()  --清屏
TalkEx("＜又让我干这伤天害理的事*情，没办法，先学了铁掌再*说！＞", 0, 1)  --对话
Cls()  --清屏
instruct_2(100, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("段皇爷现在出家了，就在前*边的村子里，法号叫一灯。", 67, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,506,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(47, 13,0,0,0,0,507,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(47, 5,1,0,482,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(47, 8,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(47, 7,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
do return end
