--OEVENTLUA[510] = function()		--射雕邪重阳宫
	instruct_14();
	instruct_13();
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
	instruct_30(41,31,41,26);
	Talk("原来大家都集合在这里，连你们这些号称为四绝的都要联手来对付我这个无名小卒，我还真感到荣幸。",0);
	instruct_14();
	instruct_3(-2,27,0,0,0,0,0,7102,7102,7102,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_0();   --  0(0)::空语句(清屏)
	instruct_13();
    instruct_1(2125,129,0);   --  1(1):[???]说: 何人敢在我重阳宫中撒野！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2126,123,0);   --  1(1):[???]说: 师父，您还活着？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2127,64,0);   --  1(1):[周伯通]说: 师兄，真的是你，太好了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2128,57,0);   --  1(1):[黄药师]说: 重阳真人，久违了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2129,69,0);   --  1(1):[洪七公]说: 重阳真人，你可是连老叫化*都瞒过啦
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2130,129,0);   --  1(1):[???]说: 贫道诈死，让各位担心了。*现在我们大家联手，对付这*恶贼！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(185,3,0,0) ==false then    --  6(6):战斗[185]是则跳转到:Label3
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
	end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2131,129,0);   --  1(1):[???]说: 真是长江后浪推前浪，看来*我们真是老了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
	instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
	instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
	instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
	instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(148,1);   --  2(2):得到物品[射鵰英雄传][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(84,1);   --  2(2):得到物品[九阴真经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,1,0,228,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
--end