--红玉初始对话
--OEVENTLUA[5205] = function()
        local picid = 333;
        local name = "慕容玄恭";
        local myname = JY.Person[0]["姓名"];
	instruct_0();
	say("人家这里好偏僻，好偏僻的……不过这样可以安心创作也好",picid,0,name);
	local title = "慕容玄恭的小屋";
	local str = "讨论游戏 ：剧情有了新突破哦"
						.."*真实体验：去那个世界体验一下"
						.."*其他 ：唠唠家常好了"
						.."*ESC键：和玄恭说再见"
	local btn = {"讨论游戏","真实体验","其他"};
	local num = #btn;
	local r = JYMsgBox(title,str,btn,num,nil,1);
    if r == 1 then
		say("我怎么总觉得你是男的，我想再检查一下",0,1,myname );
		say("你还好意思说，我不是就做了一个游戏嘛……就把人家另眼相待。",picid,0,name);
		say("只是觉得怪怪的，没什么",0,1,myname );
		say("再说了我是游戏的作者，主角又不是我，何况虽然里面有我的名字，但也是女身呀。",picid,0,name);
		say("开玩笑呢！这么腐的游戏，也就你这样的腐女作者能做出。",0,1,myname );
		say("说人家说腐女，哼！房间也这么小～",picid,0,name);
		say("小才好呀，小才紧窄，湿润么。",0,1,myname );
		say("真坏真坏～人家哰在你手上，当然随便你怎么样啦……",picid,0,name);
		say("都已经是你的人了，有空来帮我再检查一下啊～（羞红了脸）",picid,0,name);
	elseif r == 2 then
		local subname = Alungky_getSubName(name);
		say("我漂亮的"..name.."儿，听说你搞的那个后宫游戏很成功啊",0,1,myname );
		say("托您的福，的确一帮宅男腐女很热爱",picid,0,name);
		say("话说我也尝试过，感觉的确不错，内容也很充实，而且妹子都能泡，就是没激情镜头",0,1,myname );
		say("你还要激情镜头干嘛啦，这里这么多姐妹，女仆你还爽不够呀",picid,0,name);
		say("话说妹子永远是泡不够滴，而且血魔结界，更像是我的藏宝库。都已经是我的了，无论是本尊还是分身。",0,1,myname );
		say("所以有点厌倦了？",picid,0,name);
		say("也不是厌倦啦，就是想去尝尝新鲜的。大家不也是这样么，魂游结界之外。",0,1,myname );
		say("你以为大家都像你这么有空啊，事情很多的。要不是血魔结界的特性，我估计也不会有这么多姐妹安心在这里",picid,0,name);
		say("唉，只可惜你那个游戏也仅仅是一些电脑上的画面和音乐罢了，并非真的世界啊",0,1,myname );
		say("话说，如果能创造这么一个世界，那还真的挺有意思",0,1,myname );
		say("就像人类世界那样，很有意思？",picid,0,name);
		say("你那个才不是人类世界，你那个是完美后宫，无限内射（只是游戏里不显示罢了）的天堂世界",0,1,myname );
		say("你还别说，我那个剧本啊，可不是那么单纯呢，有困难，有苦涩的喔",picid,0,name);
		say("罢了罢了，再怎么样也只是游戏而已，满足吊丝的欲望罢了",0,1,myname );
		say("那如果说那是一个真的世界呢？",picid,0,name);
		say("…………",0,1,myname );
		say("那如果说你是那个世界唯一的主角呢？",picid,0,name);
		say("？？？",0,1,myname );
		say("你有办法创造世界？你和空间之神联系了？多兄现在重出江湖了？",0,1,myname );
		say("别这么多疑问，这个世界啊，还真的快造好了！",picid,0,name);
		say("！！！",0,1,myname );
		say("这是姐妹们联合天神，阴神，阿修罗界各能人异士，仙神魔鬼共同打造的新世界",picid,0,name);
		say("我说，前段时间怎么大家动静有点大？你们不会是完全为了我吧？为了我去享受",0,1,myname );
		say("别自作多情了，这个世界啊用处大着呢，只是一时说不清楚。不过我的小说游戏已经植入其中了，现在需要有人测试这个世界。",picid,0,name);
		say("这个我也许要自告奋勇了，不过万一有巴格什么的，我被人严刑拷打，哪怕是一个小分身，也难受啊。",0,1,myname );
		say("不会不会，这个游戏大家测试这么久了。应该没什么问题，而且我会和你一起去啦，真有什么问题直接回来。",picid,0,name);
		say("还不错喔～～",0,1,myname );
		say("别高兴太早了，要真体验乐趣啊，你还必须是裸分身",picid,0,name);
		say("你说像以前人类世界那样？",0,1,myname );
		say("对",picid,0,name);
		say("那不就什么记忆也没有了，额",0,1,myname );
		say("你自己看着办咯～",picid,0,name);
		say("不过你说你会陪我一起去对吧",0,1,myname );
		say("不单单我，还会有其他姐妹一起去，不过除了我啊，她们也基本都是裸分身。",picid,0,name);
		say("那不行，万一她们被别人泡了怎么办。",0,1,myname );
		say("切～那只是分身耶……算啦，你放心啦，她们啊一样会只属于你，这毕竟是已经写好的剧本。",picid,0,name);
		say("那不错！不过话说，你以什么身份和我一起去啊",0,1,myname);
		say("血魔守护神，怎么样？",picid,0,name);
		say("哇塞，那样你得在我体内耶，一个美女在我体内，我不人妖了我。",0,1,myname);
		say("你这个什么逻辑啊，血魔守护神，按照阿卡莎大人的说明，那是你我共享生命，但躯体为你，我的灵魂将浮空在你表面。",picid,0,name);
		say("关键时候，我还能显身，让你射一下，怀个孕什么的。",picid,0,name);
		say("噗，我啦，我信你啦"..subname.."。那我们什么时候出发。",0,1,myname);
		say("任何时候，这个魔球先注入你体内，你准备好了，只要打开金书红颜录的游戏，就能进入那个世界了。",picid,0,name);
		instruct_14()
        instruct_13()
        say("喂，你这也太快了吧，万一我只想先打开游戏看看呢？",0,1,myname);
        say("反正你关闭游戏，就又会自动回来的。",picid,0,name);
        say("哦？那还不错，时候有空就去试试好了",0,1,myname);
        say("祝玩的开心～",picid,0,name);
	elseif r == 3 then
		Alungky_MM_XMJJ_Def(picid, name);
	end




	
--end