TalkEx("＜这不是西毒欧阳锋吗？怎*么在这倒立……＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("乖儿子，快叫爸爸！", 60, 0)  --对话
Cls()  --清屏
TalkEx("＜不是吧，占我便宜……＞", 246, 1)  --对话
Cls()  --清屏
TalkEx("快叫爸爸，爸爸传授高深的*武功给你！", 60, 0)  --对话
Cls()  --清屏
TalkEx("＜高深的武功？＞", 0, 1)  --对话
Cls()  --清屏
if instruct_11() == false then  --是/否
	do return end  --无条件结束事件

end
instruct_37(-1)  --增加品德
TalkEx("＜你不是我的＞*爸爸！", 247, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，乖儿子，我现在就*把九阴真经传给你", 60, 0)  --对话
Cls()  --清屏
instruct_2(82, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("不对，不对，我脑子有点不*清楚，我要一个人想想……", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
