TalkEx("什么人，找死么？", 78, 0)  --对话
Cls()  --清屏
TalkEx("啊……你……你便是……铁*尸梅超风", 0, 1)  --对话
Cls()  --清屏
TalkEx("嘿嘿嘿，哈哈哈，你小子眼*里倒好，哈哈哈，你是来杀*我的么？", 78, 0)  --对话
Cls()  --清屏
TalkEx("＜这梅超风武功极高，不过*听说双目已盲。我寻找天书*正愁没有厉害的帮手，如果*她能帮我……＞，前辈莫怪*，我只是无意间闯入此山洞*，打扰了前辈练功，还望见*谅。", 0, 1)  --对话
Cls()  --清屏
TalkEx("没事就快滚吧！", 78, 0)  --对话
Cls()  --清屏
TalkEx("前辈一人独居此间，恐怕生*活上多有不便，不如与在下*同行，也好有个照应。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，梅超风从不需要人*照顾。你到底有什么企图，*明说吧！", 78, 0)  --对话
Cls()  --清屏
TalkEx("不瞒前辈，在下久仰前辈的*九阴白骨爪天下无双，企盼*前辈传授一二。", 0, 1)  --对话
Cls()  --清屏
TalkEx("想做我徒弟？＜贼汉子死了*，我的眼睛瞎了，今后还真*不知道该怎么办，这小子不*知可靠不可靠……＞。想做*我徒弟也不难，去帮我办件*事。", 78, 0)  --对话
Cls()  --清屏
TalkEx("前辈但有吩咐，无不遵从。", 0, 1)  --对话
Cls()  --清屏
TalkEx("杀了江南七怪！", 78, 0)  --对话
Cls()  --清屏
TalkEx("这……", 0, 1)  --对话
Cls()  --清屏
TalkEx("江南七怪和我有不共戴天之*仇，只要你把他们杀了，我*就传你九阴白骨爪！", 78, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,514,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(6, 0,1,0,515,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
