TalkEx("小子，你又来干什么？", 130, 0)  --对话
Cls()  --清屏
if instruct_5() == false then  --是否与之过招
	TalkEx("我，没事，随便逛逛……", 247, 1)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_37(-5)  --增加品德
TalkEx("前辈是否知道黑风双煞？", 0, 1)  --对话
Cls()  --清屏
TalkEx("岂知知道！那黑风双煞凶狠*残忍，滥杀无辜，我大哥飞*天神龙就是死在他二人手上*，不过我们也杀了那个铜尸*陈玄风！", 130, 0)  --对话
Cls()  --清屏
TalkEx("哦，那就好了，没找错人，*我今日来就是给陈玄风前辈*报仇的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么？？好啊，原来你和那*个妖女是一路的，好啊，好*啊，来吧小子！", 130, 0)  --对话
Cls()  --清屏
if WarMain(189, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(41, 1,1,0,516,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
