instruct_37(2)  --增加品德
TalkEx("段公子好，王姑娘好。恭喜*段公子终于虏获美人心。", 247, 1)  --对话
Cls()  --清屏
TalkEx("呵呵，这都多亏了少侠的帮*忙啊。", 53, 0)  --对话
Cls()  --清屏
TalkEx("哪里哪里，我不曾帮过任何*的忙，都是段公子精诚所至*，金石为开啊。但不知慕容*公子……", 0, 0)  --对话
Cls()  --清屏
TalkEx("我表哥他……他心里只有那*个虚无缥缈的皇帝梦……我*现在才知道，真心待我的只*有段公子一个人。", 76, 0)  --对话
Cls()  --清屏
TalkEx("语嫣……这位少侠帮了我们*这么多，我们也帮帮他吧。", 53, 0)  --对话
Cls()  --清屏
TalkEx("好啊，那我们就去小村吧", 76, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(104, 59,1,0,965,0,0,6308,6308,6308,-2,-2,-2)  --修改场景事件
instruct_3(104, 51,1,0,977,0,0,6296,6296,6296,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 9,1,0,143,0,0,6310,6310,6310,-2,-2,-2)  --修改场景事件
instruct_3(70, 27,1,0,167,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
