TalkEx("我该不该去呢？", 252, 0)  --对话
Cls()  --清屏
TalkEx("这位前辈在为何事烦恼？", 0, 1)  --对话
Cls()  --清屏
TalkEx("唉，我嫁给了谭公，可是我*那师兄始终对我一往情深，*如今他来找我，你说我应该*出去和她相会吗？", 252, 0)  --对话
Cls()  --清屏
if instruct_11() == false then  --是/否
	TalkEx("前辈既已嫁为人妇，理应恪*守妇道，不该再有私情，否*则怎对得起谭公呢？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("你说得对啊……", 252, 0)  --对话
	Cls()  --清屏
	TalkEx("好小子，说得有道理。这是*我钓鱼的秘方，就送给你吧*。", 253, 0)  --对话
	Cls()  --清屏
	instruct_2(177, 1)  --得到或失去物品
	Cls()  --清屏
	instruct_3(-2, 5,1,0,577,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 0,1,0,578,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 7,1,0,582,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件

end
TalkEx("既然这位赵钱孙先生对您一*往情深，在外苦苦守候，你*还是应该出去见他一面。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你说得对啊……", 252, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 6,1,0,577,0,0,7130,7130,7130,-2,-2,-2)  --修改场景事件
instruct_3(-2, 0,1,0,579,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,1,0,580,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
