instruct_14()  --场景变黑
instruct_37(-5)  --增加品德
instruct_3(40, 16,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 15,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 14,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 13,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 37,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 35,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,6152,6152,6152,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,5132,5132,5132,-2,-2,-2)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,7130,7130,7130,-2,-2,-2)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,5136,5136,5136,-2,-2,-2)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,7990,7990,7990,-2,-2,-2)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,1,0,591,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,591,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(39,30,16,29)  --人物移动
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_32(216,-1)  --得到或失去物品
TalkEx("乔峰，你看这是什麽？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是什麽？", 50, 0)  --对话
Cls()  --清屏
TalkEx("你看了便知道。", 0, 0)  --对话
Cls()  --清屏
TalkEx("这……这是真的吗？", 50, 0)  --对话
Cls()  --清屏
TalkEx("少林方丈亲笔写的，会是假*的吗！", 0, 1)  --对话
Cls()  --清屏
TalkEx("我今日请来了智光大师、谭*公、谭婆、赵钱孙等人，他*们都可以作证。", 51, 0)  --对话
Cls()  --清屏
TalkEx("我……我……*我不是汉人…………*我是契丹人…………", 50, 0)  --对话
Cls()  --清屏
TalkEx("乔峰，你是契丹人，非我族*类，其心必异，怎可担任这*丐帮帮主一职，保管《天龙*八部》一书呢！", 0, 1)  --对话
Cls()  --清屏
TalkEx("你要我怎麽做！", 50, 0)  --对话
Cls()  --清屏
TalkEx("辞去丐帮帮主之位，*交出《天龙八部》一书。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好！我今天就辞去这丐帮帮*主之位，《天龙八部》一书*你拿去吧。", 50, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(147, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("得来真是全不费功夫。", 247, 1)  --对话
Cls()  --清屏
TalkEx("阁下来此，揭发乔峰的真实*身份，让我丐帮不致误奉一*契丹人为帮主，很是感激。", 207, 0)  --对话
Cls()  --清屏
TalkEx("没什麽，这是中原武林的大*事，小弟应该做的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("但是，拜你所赐，我丐帮也*将因此事贻笑武林。你拿的*《天龙八部》是丐帮镇帮之*宝，还请阁下留下。", 207, 0)  --对话
Cls()  --清屏
TalkEx("怎麽可以，我好不容易才拿*到手的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那只好得罪了。", 207, 0)  --对话
Cls()  --清屏
if WarMain(84, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("阁下对丐帮的\"大恩大德\"全*武林的叫化子都会记得的。", 207, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，恭喜少侠如愿以偿*得到天书。", 51, 0)  --对话
Cls()  --清屏
TalkEx("哪里哪里，多亏慕容公子鼎*力相助", 247, 1)  --对话
Cls()  --清屏
TalkEx("我这就回燕子坞，兄弟如果*有需要我帮忙的地方，尽可*去燕子坞找我", 51, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(52, 1,1,0,586,0,0,6302,6302,6302,-2,-2,-2)  --修改场景事件
instruct_3(52, 2,1,0,587,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
