instruct_14()  --场景变黑
instruct_3(-2, 25,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,6382,6382,6382,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,1,0,596,0,0,6376,6376,6376,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(39,30,17,30)  --人物移动
TalkEx("现在这位庄少侠已经连胜十*场，若再无人挑战，则……", 207, 0)  --对话
Cls()  --清屏
TalkEx("谁说无人挑战？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦，你，你不就是……", 207, 0)  --对话
Cls()  --清屏
TalkEx("姓名不重要，你们看这是什*么？", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊，打狗棒，怎么会在你手*上？", 207, 0)  --对话
Cls()  --清屏
TalkEx("我有打狗棒在手，自然是下*一任帮主。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你也要当帮主，先胜过我再*说！", 48, 0)  --对话
Cls()  --清屏
if WarMain(88, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 38,1,0,597,0,0,6380,6380,6380,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("怎么样，这帮主之位舍我其*谁？", 247, 1)  --对话
Cls()  --清屏
TalkEx("好大的口气，现问过我们再*说！", 69, 0)  --对话
Cls()  --清屏
if WarMain(83, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_3(-2, 12,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 37,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 35,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
TalkEx("哈哈，这回没人反对了吧？", 247, 1)  --对话
Cls()  --清屏
TalkEx("……***这位少侠武功盖世，自*是丐帮下一代帮主，这是丐*帮历代相传的打狗棒法。", 207, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿，我就是为它而来的！", 0, 1)  --对话
Cls()  --清屏
instruct_2(167, 1)  --得到或失去物品
Cls()  --清屏
instruct_37(-5)  --增加品德
do return end
