TalkEx("一呀摸，二呀摸，摸到姐姐*的头发边……唉，我韦小宝*什么时候能离开这里，一定*要发大财，取一堆漂亮老婆*，开个特大的妓院，哈哈…*…", 225, 0)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(1,10,1,0,0)  --修改场景事件
instruct_26(1,7,1,0,0)  --修改场景事件
TalkEx("出去玩？＜这个家伙看着好*像挺能打的，跟着他不会吃*亏……我娘现在不在这……*哈哈，就这么定了……＞，*好啊，出去找漂亮老婆，好*爽好爽。", 225, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
TalkEx("韦小宝随队行动", 225, 0)  --对话
Cls()  --清屏
instruct_3(71, 20,0,0,0,0,63,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(76, 12,0,0,0,0,89,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(76, 0,1,0,0,0,0,6292,6292,6292,-2,-2,-2)  --修改场景事件
instruct_3(76, 1,1,0,0,0,0,5956,5956,5956,-2,-2,-2)  --修改场景事件
instruct_3(76, 2,1,0,0,0,0,6306,6306,6306,-2,-2,-2)  --修改场景事件
instruct_3(76, 11,1,0,0,0,0,7030,7030,7030,-2,-2,-2)  --修改场景事件
do return end
