TalkEx("看您老一脸英气凛然，*王者之尊的样子，*想必是梅庄的大庄主．", 0, 1)  --对话
Cls()  --清屏
TalkEx("不敢当，正是老夫．*不知少侠到我梅庄来有何贵*事？", 34, 0)  --对话
Cls()  --清屏
TalkEx("我听江湖上传言贵庄内卧虎*藏龙，高手如云，一时心生*好奇，特来探个究竟．", 0, 1)  --对话
Cls()  --清屏
TalkEx("我梅庄四友隐居江南已久，*对江湖之事早已淡如轻烟，*什麽卧虎藏龙，高手如云，*不过是武林中人随口胡诌罢*了．", 34, 0)  --对话
Cls()  --清屏
TalkEx("我看也是如此，其它那三位*庄主真是废物点心，三两下*就被我解决了．", 0, 1)  --对话
Cls()  --清屏
TalkEx("小子，你！", 32, 0)  --对话
Cls()  --清屏
TalkEx("这个我已听我那三个兄弟说*过，不过对於外在的声名利*禄我们早已抛诸脑後，也不*会在乎武林上对我们的评论*！少侠请慢走，老夫不送了*．", 34, 0)  --对话
Cls()  --清屏
do return end
