--龙门客栈60，新增路过事件
--OEVENTLUA[8002] = function()
	if not inteam(37) then			--队伍中没有狄云，不触发
		return;
	end
	
	instruct_3(-2,82,1,0,0,0,0,9220,9220,9220,0,0,0);			--水笙贴图
	instruct_3(-2,83,1,0,0,0,0,8902,8902,8902,0,0,0);			--汪啸风贴图
	
	Talk( "他……他是西藏青教的……的……血刀恶僧。",589);	--[水笙]：他……他是西藏青教的……的……血刀恶僧。
	TalkEx("不错，血刀淫僧。",234,0);		--[汪啸风]：不错，血刀淫僧。
	Talk("恶人，哼，滚你的罢！",589);	--[水笙]：恶人，哼，滚你的罢！
	Talk("姑娘你说甚么？",37);	--[狄云]：姑娘你说甚么？
	Talk( "你……你……你别走近我，滚开。",589);	--[水笙]：你……你……你别走近我，滚开。
	Talk("你……你干么打我？",37);	--[狄云]：你……你干么打我？
	Talk("滚开啊",589);	--[水笙]：滚开啊
	Talk("姑娘这其中是不是有什么误会。",0);		--[主角]：姑娘这其中是不是有什么误会。
	Talk("哼，和血刀恶僧在一起的也不是什么好人，师兄我们走！",589);		--[水笙]：哼，和血刀恶僧在一起的也不是什么好人，师兄我们走！
	instruct_0();   --  0(0)::空语句(清屏)
	
	instruct_14();
	instruct_3(-2,82,0,0,0,0,0,0,0,0,0,0,0);			--清除水笙贴图
	instruct_3(-2,83,0,0,0,0,0,0,0,0,0,0,0);			--清除汪啸风贴图
	instruct_13();
	

	
	Talk("好生奇怪的姑娘",0);		--[主角]：好生奇怪的姑娘
	Talk("我跟他二人无冤无仇，没半点地方得罪了他们，正说得好好地，干么忽然对我如此凶恶？",37);		--[狄云]：我跟他二人无冤无仇，没半点地方得罪了他们，正说得好好地，干么忽然对我如此凶恶？
	Talk("狄兄弟算了吧，或许是这姑娘一时的急性子。",0);		--[主角]：狄兄弟算了吧，或许是这姑娘一时的急性子。
	Talk("〈我就是这么蠢，倘若丁大哥在世，就算不能助我，也必能给我解说这中间的道理。〉",37);		--[狄云]：〈我就是这么蠢，倘若丁大哥在世，就算不能助我，也必能给我解说这中间的道理。〉
	instruct_0();   --  0(0)::空语句(清屏)
	
	if JY.Base["人X1"] == 24 then			--两个触发地方的移动方式不一样
		instruct_30(-1,9,0,0);
		instruct_30(-5,1,0,0);
	else
		instruct_30(0,9,0,0);
		instruct_30(-5,1,0,0);
	end
	
	instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);		--修改客栈门口事件
	instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);		--修改客栈门口事件
	
	
		
	instruct_14();
	instruct_3(-2,85,1,0,0,0,0,9222,9222,9222,0,0,0);			--水笙贴图
	instruct_3(-2,86,1,0,0,0,0,8904,8904,8904,0,0,0);			--汪啸风贴图
	instruct_13();
	
	
	instruct_25(4,-15,0,0);		--场景移动
	Talk("采花淫贼，赶快出来受死",589);		--[水笙]：采花淫贼，赶快出来受死
	instruct_25(-4,15,0,0);
	instruct_0();   --  0(0)::空语句(清屏)
	
	Talk("狄兄弟，那姑娘又回来了，不知道想做什么。我们出去看看吧",0);		--[主角]：狄兄弟，那姑娘又回来了，不知道想做什么。我们出去看看吧
	Talk("嗯，若不说个清楚，忌不冤枉？",37);	--[狄云]：嗯，若不说个清楚，忌不冤枉？
	instruct_0();   --  0(0)::空语句(清屏)
	
	
	instruct_30(0,-1,0,0);			--走出客栈门口
	instruct_30(5,-11,0,0);
	
	instruct_14();
	instruct_3(-2,84,1,0,0,0,0,9226,9226,9226,0,0,0);			--狄云贴图
	instruct_13();
	
	Talk( "可算出来了，有人指认你奸杀官家小姐，早知道刚才就应该杀了你。原来你……你竟这么坏。",589);		--[水笙]：可算出来了，有人指认你奸杀官家小姐，早知道刚才就应该杀了你。原来你……你竟这么坏。
	Talk("我不是采花贼",37);		--[狄云]：我不是采花淫贼
	TalkEx("淫僧，你在两湖做下了这许多案子，还想活命不成！",234,0);	--[汪啸风]：淫僧，你在两湖做下了这许多案子，还想活命不成！
	Talk("师兄，杀了这淫贼！",589);		--[水笙]：师兄，杀了这淫贼！
	Talk("我不是。〈我命中注定要给人冤枉，那也无法可想。〉",37);	--[狄云]：我不是。〈我命中注定要给人冤枉，那也无法可想。〉
	Talk("手下留人，休得伤他性命。",97);	--[血刀老祖]：手下留人，休得伤他性命。
	instruct_0();   --  0(0)::空语句(清屏)
	
	instruct_14();
	instruct_3(-2,87,1,0,0,0,0,8746,8746,8746,0,0,0);			--血刀老祖贴图
	instruct_13();
	
	Talk("徒儿退下，让老祖我来会会他。",97);	--[血刀老祖]：徒儿退下，让老祖我来会会他。
	Talk("〈这老僧好生厉害〉",0);		--[主角]：〈这老僧好生厉害〉
	TalkEx("表妹，快走！",234,0);		--[汪啸风]：表妹，快走！
	Talk("想走？",97);	--[血刀老祖]：想走？
	
	instruct_3(-2,85,1,0,0,0,0,0,0,0,0,0,0);			--水笙贴图
	instruct_3(-2,88,1,0,0,0,0,9220,9220,9220,0,0,0);			--水笙贴图
	
	Talk("好美的姑娘，哈哈！很标致，了不起！老和尚艳福不浅。",97);	--[血刀老祖]：好美的姑娘，哈哈！很标致，了不起！老和尚艳福不浅。
	TalkEx("表妹，表妹！啊！！",234,0);		--[汪啸风]：表妹，表妹！啊！！
	
	instruct_14();
	instruct_3(-2,88,0,0,0,0,0,0,0,0,0,0,0);			--清除水笙贴图
	instruct_3(-2,86,0,0,0,0,0,0,0,0,0,0,0);			--清除汪啸风贴图
	instruct_3(-2,84,0,0,0,0,0,0,0,0,0,0,0);			--清除狄云贴图
	instruct_3(-2,87,0,0,0,0,0,0,0,0,0,0,0);			--清除血刀老祖贴图
	
	instruct_3(2,81,1,0,0,0,0,9224,9224,9224,0,0,0);		--修改雪山水笙贴图
	instruct_3(2,80,1,0,0,0,0,9228,9228,9228,0,0,0);		--修改雪山狄云贴图
	instruct_13();
	
	Talk("〈糟糕，狄兄弟也被掳走了。似乎往雪山方向走了〉",0);		--主角：〈糟糕，狄兄弟也被掳走了。似乎往雪山方向走了〉
	instruct_21(37);		--狄云离队
	instruct_0();   --  0(0)::空语句(清屏)
	
	SetS(86, 9, 10, 5, 1);		--判断触发雪山事件
	
--end