--新增遇到戚长发的事件
--OEVENTLUA[8004] = function()


	--先把风清扬(140) 代替戚长发，加强能力，武功改成连城剑法
	local pid = 9999;				--定义一个临时的戚长发数据
	JY.Person[pid] = {};
	for i=1, #PSX-8 do
		JY.Person[pid][PSX[i]] = JY.Person[140][PSX[i]];
	end
	JY.Person[pid]["姓名"] = "戚长发";
	JY.Person[pid]["内力最大值"] = JY.Person[pid]["内力最大值"] * 2;
	JY.Person[pid]["内力"] = JY.Person[pid]["内力最大值"];
	JY.Person[pid]["轻功"] = JY.Person[pid]["轻功"] * 2;
	JY.Person[pid]["攻击力"] = JY.Person[pid]["攻击力"] * 2;
	JY.Person[pid]["防御力"] = JY.Person[pid]["防御力"] * 2;

	JY.Person[pid]["武功1"] = 114;
	JY.Person[pid]["武功等级1"] = 999;
	
	
	SetS(86, 10, 10, 5, 2);		--判断把战斗137的人物编号换成9999
	
	instruct_25(2,-5,0,0);

	MyTalk("不枉我装死，隐姓埋名这么辛苦。连城诀最终还是我的，哈哈哈哈~~~", 9999);		--[戚长发]：不枉我装死，隐姓埋名这么辛苦。连城诀最终还是我的，哈哈哈哈~~~
	TalkEx("师父，原来你没有死！", 37, 1);		--[狄云]：师父，原来你没有死！
	MyTalk("云儿，是你。赶紧把连城诀交出来，饶你们不死。", 9999);		--[戚长发]：云儿，是你。赶紧把连城诀交出来，饶你们不死。
	TalkEx("师父，你怎么", 37, 1);		--[狄云]：师父，你怎么
	Talk("这连城诀已经有主人了", 0);		--[主角]：这连城诀已经有主人了
	MyTalk("找死！", 9999);		--[戚长发]：找死！
	
	if WarMain(137) == false then
		instruct_15();			--战斗失败，死亡
		return;
	end
	
	
	MyTalk("不！！！*连城诀是我的，是我的！！*啊~~~~", 9999);		--[戚长发]：不！！！*连城诀是我的，是我的！！啊~~~~
	
	instruct_14();
	instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);		--清除戚长发贴图
	instruct_13();
	
	TalkEx("师父.......", 37, 1);		--[狄云]：师父.......
	Talk("狄兄弟，算了，你师父已经不是以前的师父", 0);		--[主角]：狄兄弟，算了，你师父已经不是以前的师父......
	
	
	instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);		--清除路过事件
	
	SetS(86, 10, 10, 5, 0);		--把战斗判断还原
		
	
--end