--第一次见到，独孤求败
--OEVENTLUA[8013] = function()
	MyTalk("武学之道在于变而不在于招*剑学之道不在于剑而在于心*有心万物皆为剑", 592);		--武学之道在于变而不在于招*剑学之道不在于剑而在于心*有心万物皆为剑
	MyTalk("生平求一敌手而不可得，诚寂寥难堪也", 592);		--生平求一敌手而不可得，诚寂寥难堪也
	
	if instruct_5(2,0) then
		Talk( "久仰独孤前辈大名，在下今日特来向前辈请教", 0);		--久仰独孤前辈大名，在下今日特来向前辈请教
		MyTalk("哈哈~~果然是后生可畏~~请~~", 592);	--哈哈~~果然是后生可畏~~请~~"
		
		if WarMain(239) then
			MyTalk("好，痛快！吾此生无憾已！遇到江湖大战，可别忘了告知我一番，哈哈哈哈", 592);	--好，痛快！吾此生无憾已
			instruct_3(-2,-2,-2,-2,8014,-2,-2,-2,-2,-2,-2,-2,-2);
			return;
		end
		MyTalk("武学造诣很好，只可惜太过冒进。先去江湖历练一番吧。", 592);
		instruct_3(-2,-2,-2,-2,8015,-2,-2,-2,-2,-2,-2,-2,-2);
	end
--end