--蓝烟清：田伯光，高升客栈调戏小琳戏事件
--OEVENTLUA[8016] = function()
	if inteam(29) and GetS(86,10,11,5) == 0 and GetD(1,15,4) <= 0 then
	
		instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);			--
	
		instruct_3(-2,37,1,0,0,0,0,2598*2,2598*2,2598*2,0,0,0);			--仪琳贴图
		instruct_25(0, 4, 0, 0);
		Talk( "哎，贤弟，你看那边，那小妮子长得好生俊俏呀。虽是个小尼姑，但也别有一番风味哦。", 29);		--哎，贤弟，你看那边，那小妮子长得好生俊俏呀。虽是个小尼姑，但也别有一番风味哦。
		Talk( "哦，是吗？咦，她长得倒真是挺俊美呀，可她是个小尼姑哦！田兄，莫非连这类型的也感兴趣？", 0);		--哦，是吗？咦，她长得倒真是挺俊美呀，可她是个小尼姑哦！田兄，莫非连这类型的也感兴趣？
		Talk("哎呀，贤弟，我管她小尼姑还是小蘑菇，只要是年轻俊美的女人，我“采花大盗“田大侠就绝不会放过，哈哈哈，要不贤弟，你我一起去风流风流？哈哈…..", 29);	--哎呀，贤弟，我管她小尼姑还是小蘑菇，只要是年轻俊美的女人，我“采花大盗“田大侠就绝不会放过，哈哈哈，要不贤弟，你我一起去风流风流？哈哈…..
		Talk("……", 0);		--……
		
		instruct_14();
		instruct_3(-2,36,1,0,0,0,0,3615*2,3615*2,3615*2,0,0,0);			--田伯光贴图
		JY.Base["人X1"] = 21
		JY.Base["人Y1"] = 22
		instruct_40(1);		--主角位置变化
		instruct_3(-2,37,1,0,0,0,0,2600*2,2600*2,2600*2,0,0,0);			--仪琳贴图
		instruct_13();
		
		
		Talk("哈哈，小美人，你这小脸蛋长得可真好看呀，看的我田大爷是心花怒放啊，真是越看越喜欢呀。来，陪我田大爷玩玩吧。就你这花容月貌的姿色，做小尼姑，实在太可惜啦。", 29);	--哈哈，小美人，你这小脸蛋长得可真好看呀，看的我田大爷是心花怒放啊，真是越看越喜欢呀。来，陪我田大爷玩玩吧。就你这花容月貌的姿色，做小尼姑，实在太可惜啦。
		MyTalk1("啊，你这色胆包天的淫贼，光天化日之下竟敢这样轻薄于人？", 330, "仪琳");--啊，你这色胆包天的淫贼，光天化日之下竟敢这样轻薄于人？
		Talk( "哈哈，这天下之大，到处都是我田某的家。估计你一直都还没被滋润过吧？今日就让我田大爷来给你滋润滋润吧，这也是你的福气哦，来吧！小美人…", 29);	
		MyTalk1( "啊，救命呀。。。。", 330, "仪琳");
		
		instruct_14();
		instruct_3(-2,39,1,0,0,0,0,3574*2,3574*2,3574*2,0,0,0);			--令狐冲贴图
		instruct_13();
		
		Talk( "好大胆的淫贼", 35);		--好大胆的淫贼
		
		--战胜，田伯光全属性+10
		if WarMain(241) then
			AddPersonAttrib(29, "攻击力", 10);
			AddPersonAttrib(29, "防御力", 10);
			AddPersonAttrib(29, "轻功", 10);
			QZXS("田伯光攻防轻各上升十点");
		end
		
		Talk("姑娘，此淫贼刀法快如疾风，你我不可力敌，我们快跑。。。", 35);
		
		instruct_14();
		instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);			--令狐冲贴图
		instruct_13();
		
		Talk("跑得真快！妈拉个吧子，这么好的好事都被人给搅了，真是气死老子了，这次算他们走运，下次如果再让我遇到这小子，我定要饶不了这小子，还有那小尼姑！哼！！！", 29);
		
		instruct_14();
		instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);			
		instruct_13();
		
		instruct_37(-1);	--道德-1
		SetS(86,10,11,5,1);
	end
	
--end