--蓝烟清：田伯光，恒山派再遇仪琳小师妹
--OEVENTLUA[8017] = function()
	if inteam(29) and GetS(86,10,11,5) == 2 then
		Talk("哈哈，可爱的小美人，上次你我一别，那我对你可是日思夜想呀，就连在梦中都会思念你那俊俏的小脸蛋，今日田爷我再也耐不住对你那滔滔不绝的思念，特意来恒山找你哦，可真是想死我了呀。", 29);
		MyTalk1("天啊，你这淫贼，竟找到这里来了，救命啊。。。师傅，师傅", 330, "仪琳");
		Talk("哈哈，别叫了，小美人，虽然你这么喜欢挣扎，又爱冲动，但我田大爷就是喜欢。快来吧，小宝贝，快放弃你这无谓的抵抗，快从了我田大爷吧，哈哈。。。今日我田爷，就让你明白明白，什么叫做鱼水之欢。哈哈哈。。。", 29);
		
		instruct_3(-2, 40, 1, 0, 0, 0, 0, 2968*2, 2968*2, 2968*2, 0, 0, 0);
		instruct_3(-2, 41, 1, 0, 0, 0, 0, 5196, 5196, 5196, 0, 0, 0);
		instruct_3(-2, 42, 1, 0, 0, 0, 0, 5196, 5196, 5196, 0, 0, 0);
		
		Talk("大胆淫贼，竟来到我恒山派做如此龌龊不堪之事，你这不知天高地厚的淫贼，还有没有王法？来人啊，速将此淫贼给我拿下…", 21);
		
		if WarMain(242) == false then			--战定闲，失败死亡
			instruct_15();
			return;
		end
		
		Talk("哈哈，你们恒山派也不过如此嘛。这江湖上都是成者为王败者为寇，定仪师太，我田某敬你是江湖前辈，你若交出我心爱的仪琳小师妹，我就此作罢，若不然，今日我就要踏平你们恒山派，然后将你们这些尼姑通通卖到我最爱的丽春院去，哈哈哈哈….", 29);
		Talk("你，你，你这个狂徒….", 21);
		Talk("哈哈哈…哼，给我快交出仪琳！", 29);
		
		instruct_3(-2, 43, 1, 0, 0, 0, 0, 4412*2, 4412*2, 4412*2, 0, 0, 0);
		MyTalk( "大胆淫贼，竟敢欺我女儿！", 593);		--
		
		if WarMain(243) then		--战不戒和尚
			Talk( "田兄，依我看今日之事，未免闹得有些大了，以田兄的武功与风流，这漂亮女人并不是难事，更何况人家现在又以死相搏，如若我们还要强取，这今后在江湖上，你我都不好立足啊。希望田兄看在我的薄面上，先放过仪琳，况且日后，这年轻貌美的女子还有的是呢！何必为了一个小尼姑而闹得血流成河呢？今日就请田兄先暂且罢手把。好吗？", 0);
			Talk( "这…，哎，成吧，那今日就看在贤弟你面子上，放过他们。", 29);
			Talk("那在下在此就先谢过田兄了，田兄，我们走吧….", 0);
			
			
			QZXS(JY.Person[29]["姓名"] .. " 学会指令浪荡");
      GRTS[29] = "浪荡"
      GRTSSAY[29] = "效果：本次攻击有机率打出浪荡招式*条件：体力大于50 内力大于500*消耗：体力12点 内力500点"
			
			SetS(86,10,12,5,1);		--不被阉割
		else	--战败
			MyTalk("哈哈，淫贼，今日你尝到了我不戒和尚的厉害了吧，居然还想欺霸我女儿，真是赖蛤蟆想吃天鹅肉，今日我就让你以后都再也不到吃天鹅肉。我让你做一辈子的癞蛤蟆。哈哈哈。。。", 593);
			lib.FillColor(0, 0, CC.ScreenW, CC.ScreenH, C_RED, 128)
      ShowScreen()
      lib.Delay(80)
      lib.ShowSlow(15, 1)
      Cls()
      lib.ShowSlow(100, 0)
      
      Talk("啊。。。。你这个万恶狠毒的秃驴。", 29);			--啊。。。。你这个万恶狠毒的秃驴。
      JY.Person[29]["性别"] = 2
      local add, str = AddPersonAttrib(29, "攻击力", -15)
      DrawStrBoxWaitKey(JY.Person[29]["姓名"] .. str, C_ORANGE, CC.DefaultFont)
      add, str = AddPersonAttrib(29, "防御力", -15)
      DrawStrBoxWaitKey(JY.Person[29]["姓名"] .. str, C_ORANGE, CC.DefaultFont)
      
      QZXS(JY.Person[29]["姓名"] .. " 学会指令戒色");
      GRTS[29] = "戒色"
      GRTSSAY[29] = "效果：本回合气防和集气速度提高，受到伤害减少*条件：体力大于50 内力大于500*消耗：体力10点 内力500点"
      
      SetS(86,10,12,5,2);		--被阉割
        
        
		end
		
		instruct_14();
		instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);			--清除贴图
		instruct_13();
	end
--end
