--brolycjw神雕剧情
--古墓
--OEVENTLUA[8201] = function()
	Talk("龙姑娘，你怎么哭成这样，杨兄的伤。。。",0);
	Talk( "龙儿，你别哭。。咳。。金轮这掌用了十成内力，看来是想让你一击致命。。咳。。而我剩下的时间也不多了。",58);
	if instruct_16(16)  then
		Talk("这伤由我来看看。",16);
		Talk("五脏六腑已经被击毁，居然还能靠深厚的内力顶到现在，可是。。",16);
		Talk( "那过儿还有救吗？快想办法救他!",59);
		Talk("方法是有，只不过。。。",16);
		Talk("是什么？我什么都愿意尝试！",59);
		Talk("是一条人命。必须把一个活人的五脏六腑移植到杨过身上，之后那活人立刻死亡。而杨过也不一定能生存。时间不多了，必须立刻动手。",16);
		Talk("这里都是死人，怎么找一个活人啊？除非我们当中其中一人。。",0);
		Talk("不行！！我绝不允许你们任何一人为我牺牲。",58);
		Talk( "过儿，要是你死了，我也没有任何生存的意义了。既然都得死，我更希望你能活着。",59);
		Talk("龙儿，不要啊！兄弟，快阻止她！",58);
		Talk("不要阻止我，天书在我这，要是你不让我救过儿我就把它给毁了。",59);
		Talk("这。。杨兄。。对不起。。医生，你动手吧。",0);
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		--小龙女死亡
		instruct_2(153,1);   --  2(2):得到物品[神鵰侠侣][1]
		Talk("龙儿！！",58);
		Talk("杨兄，你醒了？",0);
		Talk("龙儿，龙儿呢？",58);
		Talk("这。。龙姑娘她。。",0);
		Talk("啊！！！！龙儿！！龙儿！！",58);
		Talk("＜这嗓子实在惊人，要不是我用内功顶着，早就被震昏了。＞杨兄，节衷顺变吧。。",0);
		Talk("兄弟，我舍命救你，你却为了天书不肯阻止龙儿。。你。。",58);
		Talk("对不起，请让我解释。。",0);
		Talk("算了，不用解释了，既然天书你已经有了，你走吧。我这一辈子不想在见到你。",58);
		instruct_14();   --  14(E):场景变黑
		SetS(18,44,30,3,10)
		SetS(18,44,31,3,11)
		instruct_3(-2,10,0,0,0,0,8203,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
		instruct_3(-2,11,0,0,0,0,8203,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
		instruct_3(-2,0,1,0,8202,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
	else
		Talk("为什么要替我牺牲？",0);
		Talk("别把我看得那么伟大，杨某一向来最讨厌欠人，当日你救了我，让我能再看到龙儿，我这命也是欠你的。咳。。今日总算还给你了。",58);
		Talk( "虽然如此，看到龙儿如此难过，而我死后又只剩下她一人。。希望你答应我一件事。",58);
		Talk("什么事，只要在我能力范围，我一定办到。",0);
		Talk("龙儿以后就拜拖你了照顾了。",58);
		Talk("我就算放弃天书也不会让龙姑娘有什么三长两短，你放心吧。",0);
		Talk("不要，过儿，要是你死了我也不想活了。",59);
		Talk("龙儿，你也要答应我一件事。一定要好好的活下去。。我爱你。。",58);
		Talk("过儿！过儿！呜。。呜。。",59);
		--杨过死亡
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		Talk("龙姑娘，这古墓实在不适合居住，你还是和我回小村吧。",0);
		Talk("过儿，对不起，我无法遵循你临死前的吩咐，我们来世再见吧。",59);
		Talk("＜不好，这种时候还是要用激将法。＞龙姑娘，你要死挺简单，但你死了谁为杨大哥报仇？你可别指望我，一来我武功低微，打不过金轮。二来我也不欠杨兄什么，没必要非得替他报仇。你要死就死，只是可怜了杨大哥被金轮暗算，却连为出头的人都没人！",0);
		Talk("你……这……！",59);
		Talk( "龙姑娘，你要死，我绝不劝你，但我觉得你死前最应该做的是为杨兄报仇，也对得起杨兄生前对你的一往情深！",0);
		Talk("好，我就听你一言，杀了金轮再到地下找我的过儿。",59);
		Talk("放心，我会帮你的。虽然我武功低微，但总能起到一些作用。",0);
		Talk("好。咱们走吧。",59);
		Talk("＜幸亏我劝服她了，要是他们俩都死了，我上哪找天书？＞",0);
		SetS(18,14,17,3,12)
		instruct_3(-2,12,1,0,8207,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
			if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
				instruct_10(59);   --  10(A):加入人物[小龙女]
				instruct_14();   --  14(E):场景变黑
				instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
				instruct_3(104,76,1,0,970,0,0,7242,7242,7242,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [76]
				instruct_3(61,14,1,0,8205,0,0,8010,8010,8010,-2,-2,-2);   --  3(3):修改事件定义:场景[高升客栈]:场景事件编号 [61]
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_13();   --  13(D):重新显示场景
				do return; end
			end    --:Label2

			instruct_1(391,59,0);   --  1(1):[小龙女]说: 你的队伍已满，我无法加入。
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_3(-2,1,1,0,8206,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [1]
			do return; end
	end
--end