--OEVENTLUA[8204] = function() --法王攻击古墓事件
	
	Talk("杨过，想要活着的话就把那本书交出来！",62);
	Talk("我不是已经说过了，那本书已经被人拿走了，不在我这。",58);
	Talk( "既然你硬不肯把它交出来，只好把你杀了再搜你的尸。",62);
	Talk("住手！你们要的东西在我这！要抢就来吧！",0);
	--战斗
	if instruct_6(244,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
		instruct_15(0);   --  15(F):战斗失败，死亡
		instruct_0();   --  0(0)::空语句(清屏)
		do return; end
	end    
	instruct_14();   --  14(E):场景变黑
	instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
	instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	instruct_19(15,17);   --  19(13):主角移动至F-D
	instruct_40(0);
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_13();   --  13(D):重新显示场景	
	Talk("杨兄，你没事吧？",0);
	Talk("你还来这里做什么？我不是说过不想再见到你了吗？",58);
	Talk("你救了我一命，见到你有难，便有责任救你。我虽然不是什么英雄好汉，但还是讲义气的。",0);
	Talk("龙姑娘的死也是我的错，这里是九阴真经里的疗伤法，只要你练了很快就能复原。虽然知道无法弥补，不过我能做的就只有这些。",0);
	Talk("哼!龙儿都保护不了，有了武功又有什么用呢？",58);
	Talk("杨兄如果要继续堕落下去，相信龙姑娘在天之灵也会替你难过的。",0);
	Talk("。。我知道了。这九阴真经我练了便是。",58);
	Talk("虽然金轮被我打跑了，但过不不久又会回来，你的伤还没完全恢复，还是先跟我回小村吧。",0);
	Talk("好，我就暂时去小村避一避。",58);
	instruct_14();   --  14(E):场景变黑
	SetS(86,11,11,5,2)
	instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
	instruct_3(104,68,1,0,969,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [68]
	instruct_3(70,19,1,0,151,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [19]
	instruct_3(60,20,1,0,589,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[龙门客栈]:场景事件编号 [20]
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end