--OEVENTLUA[8205] = function() --杀法王事件
	if instruct_16(59) == true then
		Talk("当日那小子，还有小龙女？我不是说了吗？天书在杨过手里。",62);
		Talk("今日来不是为了天书，是为了取你的狗命！！",0);
		SetS(86,11,12,5,1)
		--战斗
		if instruct_6(79) ==false then    --  6(6):战斗[74]是则跳转到:Label2
			instruct_15(0);   --  15(F):战斗失败，死亡
			instruct_0();   --  0(0)::空语句(清屏)
			do return; end
		end 
		SetS(86,11,12,5,0)
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
		instruct_3(60,20,1,0,589,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[龙门客栈]:场景事件编号 [20]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		Talk("龙姑娘，我们终于为杨兄报仇了！＜糟了，大仇已报，小龙女该不会又想自杀吧？！＞",0);
		Talk("过儿……！",59);
		Talk( "龙姑娘，又想起杨大哥了？人死不能复生，我劝你还是节衷顺变吧。你如果真的那么爱杨兄的话，就应该听他的话好好活下去，杨兄的在天之灵才会欣慰！",0);
		Talk("其实，你不用劝我，这段时间我想了很久。。。现在大仇已报，心情也平静下来。过儿即然要我好好活下去，我就会好好的活下去的。",59);
		Talk("这就对了，杨兄对我恩重如山，我已经把他当成我的拜把兄弟，你就叫我大哥好了。龙姑娘日后有何打算，如有什么需要可尽管开口。",0);
		Talk("多亏今日有大哥在，我才能替过儿报仇。神雕侠侣这本书就赠给少侠吧。至于以后嘛，龙儿愿跟随大哥寻一起找天书。",59);
		Talk("放心吧，我既然答应了杨兄，就算牺牲自己的性命，也不会让你受到任何损伤。＜唉。。带着一个寡妇我也别指望想泡到妞了。。＞",0);
		instruct_2(153,1);   --  2(2):得到物品[神鵰侠侣][1]
		Talk("还有，这是过儿生前自创的掌法，大哥你的武学知识不浅，希望将来能把这掌法发扬光大。",59);
		instruct_2(87,1);   --  2(2):得到物品[黯然销魂掌][1]
		Talk("我对掌法的了解还不够，不过我那些江湖朋友可能在这方面比较突出。",0);
	else
		Talk("又是你？今天老子不想杀人。快滚！",62);
	end
--end
