--OEVENTLUA[8303] = function()	--中线石破天侠客岛入队事件
	if instruct_16(591,2,0) ==false then    --  16(10):队伍是否有[石中玉]是则跳转到:Label0
		Talk("。。。",38);
		instruct_0();   --  0(0)::空语句(清屏)
		do return; end
    end    --:Label0

	 if instruct_9(0,95) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
		JY.Person[38]["武功等级1"] = 900; 
		JY.Person[38]["武功等级2"] = 900; 	
		JY.Person[38]["武功等级3"] = 900; 
		JY.Person[38]["攻击力"] = 200;   
		JY.Person[38]["轻功"] = 160;   
		JY.Person[38]["防御力"] = 200;  
		Talk("。。。",38);
		Talk("不要用这种眼光看这我，我跟你可不熟！",591);
		Talk("石兄弟，你武功那么高强，如果能得到你的帮助，相信要取得天书一定容易许多。不如你加入我吧？",0);
		Talk("好啊，阿绣不知道去哪了，反正我也没地方去，就跟大哥你。",38);
		Talk("＜喂。。你真想让这白痴跟着我们？＞",591);
		Talk( "＜你想想，他武功高强，而且又跟你长得完全一模一样的人，你的仇家如果追上，你可以利用他当挡箭牌。＞",0);
		Talk("＜你这话有点道理。。＞",591);
		instruct_3(104, 43,1,0,957,0,0,7074,7074,7074,-2,-2,-2) --Alungky 将石破天放到钓鱼岛
		instruct_2(72,1);		--得到十八泥偶
        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            instruct_10(38);   --  10(A):加入人物[石破天]
            do return; end
        end    --:Label1
        instruct_1(12,38,0);   --  1(1):[石破天]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(70,16,1,0,127,0,0,6410,6410,6410,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [16]
        instruct_3(70,58,1,0,127,0,0,6412,6412,6412,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [58]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label0
--end