--OEVENTLUA[8304] = function()	--正线侠客岛战欧阳锋鸠摩智
	Talk("小子，把天书交出来，否则你性命难保。",60);
	Talk("想要天书就来抢吧！",0);
	Talk("臭小子，你真有种。看招！",103);
    if instruct_6(168,4,0,0) ==false then    --  6(6):战斗[168]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0
	Talk("就知道拿到天书不可能那么容易，还好我有心里准备。",0);
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
	
	SetS(86,20,20,5,0)		--蓝烟清：侠客行后没有还原数据，家里木桩变成欧阳锋鸠摩智
--end