TalkEx("适才听那李莫愁之言，姑娘*似乎是桃花岛主黄药师之徒*？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不错，我算是恩师黄药师的*关门弟子吧。", 63, 0)  --对话
Cls()  --清屏
TalkEx("如此说来，姑娘武功一定是*不错的了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哪里哪里，恩师传我一套玉*箫剑法，我还未练得纯熟。", 63, 0)  --对话
Cls()  --清屏
TalkEx("那程姑娘可否与在下一游，*帮忙在下寻找那十四天书？", 0, 1)  --对话
Cls()  --清屏
if instruct_28(0,65,999) == false then  --判断品德是否在范围之内
	TalkEx("我看公子脸上泛有戾气，公*子还是多做些善事才是．", 63, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,-2,0,844,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件

end
TalkEx(" 嗯！好吧．*反正我一人在此也是无聊，*就随公子一游吧．", 63, 0)  --对话
Cls()  --清屏
instruct_3(104, 60,1,0,971,0,0,7244,7244,7244,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_10(63)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 63, 0)  --对话
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 30,1,0,155,0,0,6120,6120,6120,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
