instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(47,29,33,29)  --场景移动
TalkEx("我五岳剑派同气连枝，百余*年来携手结盟，早便如同一*家．*兄弟忝为五派盟主，亦已多*历年所．只是近来武林中出*了不少大事，兄弟与五岳剑*派的前辈师兄们商量，均觉*若非连成一派，统一号令，*来日大难，只怕不易抵挡．", 22, 0)  --对话
Cls()  --清屏
TalkEx("不知左盟主和那一派的前辈*师兄们商量过了？怎地我莫*某人不知其事？", 20, 0)  --对话
Cls()  --清屏
TalkEx("兄弟适才说到，武林中出了*不少大事，五派非合而为一*不可．*其中一件大事，便是咱们五*派中人，自相残杀，不顾同*盟义气．*莫大先生，我嵩山派弟子费*师弟，在衡山城外丧命．**有人亲眼目睹，说是你莫大*先生下的毒手，不知此事可*真？", 22, 0)  --对话
Cls()  --清屏
TalkEx("并无其事！谅莫某这一点微*末道行，怎杀得了那大嵩阳*手？", 20, 0)  --对话
Cls()  --清屏
TalkEx("莫兄，这件事你也不用太过*担心，等我五派合并之後，*莫兄和我也是师兄弟了．*死者已矣，活着的人又何必*再逞凶杀，多造杀孽？*莫兄，你说是不是呢？", 22, 0)  --对话
Cls()  --清屏
TalkEx("哼！", 20, 0)  --对话
Cls()  --清屏
TalkEx("南岳衡山派於并派之议，是*无意见了．东岳泰山派天门*道兄，贵派意思如何？", 22, 0)  --对话
Cls()  --清屏
TalkEx(" 泰山派自祖师爷东灵道长创*派以来，已三百余年．贫道*无德无能，不能发扬光大泰*山一派，可是这三百多年的*基业，说什麽也不能自贫道*手中断绝．*并派之议，万万不能从命．", 23, 0)  --对话
Cls()  --清屏
TalkEx("道兄此言差矣．五派合并後*我五岳派声势壮大，其下各*个弟子，那一个不沾到光？*道兄何必为这区区泰山派掌*门一职的私心，而阻扰了全*派的大业．", 22, 0)  --对话
Cls()  --清屏
TalkEx("我这掌门人，做不做有什麽*干系？只是泰山一派，恁说*也不能在我手中给人并吞．", 23, 0)  --对话
Cls()  --清屏
TalkEx("道兄说了这麽多，*心中却就是为了放不下掌门*人的名位．", 22, 0)  --对话
Cls()  --清屏
TalkEx("你真道我是如此私心？*好，从此刻起，我这掌门人*不做了．．．", 23, 0)  --对话
Cls()  --清屏
TalkEx("道兄是赞成此事了．．．", 22, 0)  --对话
Cls()  --清屏
TalkEx("你．．．．．．", 23, 0)  --对话
Cls()  --清屏
TalkEx("＜这老道性子太急了，一被*激就着了人家的道＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("左盟主已然身为五岳剑派盟*主，位望何等尊崇，何必定*要并五派，由一人任掌门．", 21, 0)  --对话
Cls()  --清屏
TalkEx("师太此言差矣．左某只是提*议五派合并．**这掌门之位，当然还是要由*我五派之人推举出来．", 22, 0)  --对话
Cls()  --清屏
instruct_25(33,29,47,29)  --场景移动
instruct_30(47,29,35,29)  --人物移动
TalkEx("我看别讨论了，学武之人，*就在武功下见真章．*来来来，有谁要跟我打？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不知阁下是谁？竟擅闯我嵩*山派，你不知道我五岳派在*此聚会吗？", 22, 0)  --对话
Cls()  --清屏
TalkEx(" 这位少侠前些时日来到我华*山，*我已让他入我华山派了．", 19, 0)  --对话
Cls()  --清屏
TalkEx("原来是华山派的弟子，照如*此说，岳先生也是赞成这*”比剑夺帅”的方法了？", 22, 0)  --对话
Cls()  --清屏
TalkEx("比剑夺帅，原也是一法，*但只可点到为止，*以免伤了和气．", 19, 0)  --对话
Cls()  --清屏
TalkEx("原来华山派是赞成并派的，*我天门就先来领教你华山派*的高招．", 23, 0)  --对话
Cls()  --清屏
if WarMain(30, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("让我定闲来领教领教华山派*的高招．", 21, 0)  --对话
Cls()  --清屏
if WarMain(31, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你连战两场，*先下去休息吧．", 20, 0)  --对话
Cls()  --清屏
TalkEx("没关系，少年人体力充沛，*莫掌门请出手吧．", 0, 1)  --对话
Cls()  --清屏
if WarMain(32, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("真所谓”长江後浪推前浪”*华山派岳先生为了今天，*想必已筹划很久了吧．*若左某也败了，我嵩山派自*当奉岳先生为掌门．", 22, 0)  --对话
Cls()  --清屏
if WarMain(33, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("终於都解决了，好累．*左冷禅，看来你的阴谋是无*法达成了．", 0, 1)  --对话
Cls()  --清屏
TalkEx("我不该低估你的．*岳不群．想不到你的心计比*我还深，左某是输你一筹．", 22, 0)  --对话
Cls()  --清屏
TalkEx("胡说八道，人家岳先生才不*想做什麽掌门呢．**今天我来，其最主要的就是*要阻止你并派的阴谋．", 0, 1)  --对话
Cls()  --清屏
TalkEx("岳兄当真不做这五岳派的掌*门？", 22, 0)  --对话
Cls()  --清屏
TalkEx("没错，我是跟这位少侠提到*过，急於合并各派，实是难*如登天，且会引起武林纠纷", 19, 0)  --对话
Cls()  --清屏
TalkEx("你看，我说的没错吧．", 0, 1)  --对话
Cls()  --清屏
TalkEx("但是各家门派如能择地域相*近，武功相似，又或相互交*好，先行进行合并．*则十年八年之内，门户宗派*便可减少一大半．慢慢来的*话问题较小．*咱们五岳剑派今日合成五岳*派，就可为各家各派树一典*范，他日必能成为武林中千*古艳称的盛举．", 19, 0)  --对话
Cls()  --清屏
TalkEx("＜事情怎会变成这样？好像*跟我想的不太一样！＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("嗯，五岳派今日新创，百废*待举，在下只能总领其事，*各派的事务，还是由各派原*任掌门主持．***咱们五岳派今日合并，若不*能和衷同济，那麽五派合并*云云，也只是虚名而已．*在下无德无能，暂且执掌本*门门户，种种兴革，还须和*众位兄弟从长计议，在下不*敢自专．***现下天色已晚，各位都辛苦*了，今天就到此为止，他日*再到华山来共商大事．", 19, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 49,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(27, 54,0,0,902,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(58, 10,0,0,903,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(29, 1,0,0,905,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(31, 0,0,0,904,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(57, 1,0,0,906,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(57, 32,1,0,907,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(81, 0,0,0,0,0,908,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
