instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 83,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 84,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 85,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(28,28,15,28)  --人物移动
Cls()  --清屏
TalkEx("你就是东方不败？*＜怎麽看起来像个娘们？＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊！你便是到梅庄救走任我*行的那小子．我早想见你一*见，看看是怎样的一位俊俏　*郎君．***哼，依我看也是平平无奇，*比起我那莲弟来，可差的远*了．", 27, 0)  --对话
Cls()  --清屏
TalkEx("任教主、向大哥、令狐大哥*、任大小姐，你们怎么样？", 0, 1)  --对话
Cls()  --清屏
TalkEx("还好，死不了。这东方不败*已经练成葵花宝典上的武功*，你们可千万小心。", 26, 0)  --对话
Cls()  --清屏
TalkEx("任教主，我看你是老糊涂了*。你的吸星大法，加上令狐*冲的独孤九剑，都不是我的*对手，你却让这个小娃娃来*送死，嘻嘻嘻……", 27, 0)  --对话
Cls()  --清屏
TalkEx("＜她一笑起来好恶心……我*最讨厌断背山了！＞，你这*个不男不女的老妖怪，我来*会会你！", 245, 1)  --对话
Cls()  --清屏
TalkEx("大胆！", 27, 0)  --对话
Cls()  --清屏
if WarMain(54, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 0,1,0,895,0,0,5910,5910,5910,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,1,0,895,0,0,5908,5908,5908,-2,-2,-2)  --修改场景事件
instruct_3(-2, 94,1,0,896,0,0,7218,7218,7218,-2,-2,-2)  --修改场景事件
instruct_3(-2, 86,0,0,0,0,0,7966,7966,7966,-2,-2,-2)  --修改场景事件
instruct_3(-2, 55,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 95,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("东方不败，今日终於．．．*终於教你落在我手里．", 26, 0)  --对话
Cls()  --清屏
TalkEx("任教主，终究是．．是．．*终究是．．是我输了．", 27, 0)  --对话
Cls()  --清屏
TalkEx("哈！哈！*你这大号，可得改一改罢？", 26, 0)  --对话
Cls()  --清屏
TalkEx("倘若单打独斗，*你们是不能打败我的．", 27, 0)  --对话
Cls()  --清屏
TalkEx("不错，你武功比我高，*我很是佩服．", 26, 0)  --对话
Cls()  --清屏
TalkEx("你能这麽说，*足见男子汉大丈夫气概．**唉，冤孽，冤孽，我练了那*”葵花宝典”，照着宝典上*的秘方，自宫练气，炼丹服*药，渐渐的胡子没有了，说*话声音变了，性子也变了．**我从此不爱女子，把七个小*妾都杀了，却．．．却把全*副心意放在莲弟身上．*倘若我生为女儿身，那就好*了．*任教主，你快把我杀了！", 27, 0)  --对话
Cls()  --清屏
TalkEx("我现在不想杀你了，*我也找个地方安养你好了．**来人啊，把他带下去．", 26, 0)  --对话
Cls()  --清屏
TalkEx("你好狠毒！", 27, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 86,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(93, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("恭喜教主，今日诛却大逆．*从此我教在教主庇荫之下，*扬威四海．*教主千秋万载，一统江湖．", 33, 0)  --对话
Cls()  --清屏
TalkEx(" 胡说八道！什麽千秋万载*？哈！哈！哈！", 26, 0)  --对话
Cls()  --清屏
TalkEx("＜坐在这位子上的，是任我*行还是东方不败，却有什么*分别？＞*（盈盈，我……想离开这里*……）", 35, 0)  --对话
Cls()  --清屏
TalkEx("（冲哥，我知道你的心思。*如今东方不败已死，我也没*有留在黑木崖上的必要，我*们一起走吧，离开这里，找*一个没有人的地方，只有你*和我……）", 73, 0)  --对话
Cls()  --清屏
TalkEx("（好盈盈，你果然是我的知*己，我们这就悄悄走吧。）", 35, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 96,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 97,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("小兄弟，这一役诛奸复位，*你实占首功．不如加入我日*月神教，我可以给你个副教*主做做，待我百年之后，这*教主的位置就是你的，如何*？", 26, 0)  --对话
Cls()  --清屏
TalkEx("在下还要继续寻找十四天书*，加入神教之事万难从命。*还望任教主话复前言，告诉*我《笑傲江湖》一书的所在*。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼！就算你得到了十四天书*，你也未必当的成武林盟主*。当武林盟主要靠实力的！**《笑傲江湖》一书，就在*岳不群手上。", 26, 0)  --对话
Cls()  --清屏
TalkEx("哦？此话当真？", 0, 1)  --对话
Cls()  --清屏
TalkEx("当然是真的！《笑傲江湖》*一书一直在华山派，当年我*日月神教曾经为了此书，血*洗华山，不幸中了五岳剑派*的诡计，十长老尽数困死在*华山思过崖。此后《笑傲江*湖》一书便不知所踪。不过*经过老夫的明查暗访，终于*得知此书根本没离开过华山*派，就在岳不群手上。所谓*“不知所终”，不过是这个*伪君子散布的谣言罢了。", 26, 0)  --对话
Cls()  --清屏
TalkEx("多谢了，我这就上华山！", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, 35,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 25,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,1,0,889,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(57, 1,1,0,913,0,0,5696,5696,5696,-2,-2,-2)  --修改场景事件
instruct_3(57, 0,1,0,0,0,0,5694,5694,5694,-2,-2,-2)  --修改场景事件
instruct_3(57, 32,1,0,900,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
do return end
