instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,6078,6078,6078,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,7216,7216,7216,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,7002,7002,7002,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,7146,7146,7146,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(49,35,26,35)  --人物移动
instruct_30(26,35,26,23)  --人物移动
TalkEx("令狐大哥，你已经找到任大*小姐啦。任教主、向大哥，*小弟有礼了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("小兄弟，多日不见，近来可*好？", 234, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，我认得你，在梅庄地*牢曾与老夫比武过招，小兄*弟武艺不错！老夫得以重见*天日，你功劳不小啊，哈哈*哈……", 26, 0)  --对话
Cls()  --清屏
TalkEx("多谢任教主夸奖。", 0, 1)  --对话
Cls()  --清屏
TalkEx("…………", 35, 0)  --对话
Cls()  --清屏
TalkEx("小兄弟，你功夫这么好，不*如再帮老夫一个忙。", 26, 0)  --对话
Cls()  --清屏
TalkEx("任教主有事尽管吩咐。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我近日就要重上黑木崖，找*那东方不败算算旧帐，小兄*弟可否助我一臂之力？", 26, 0)  --对话
Cls()  --清屏
TalkEx("＜听说日月神教教主东方不*败，已练成葵花宝典，武功*深不可测，这可是玩命的事* 啊……＞*这个……", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，我不会让小兄弟白*出力的，你有什么要求，尽*管说吧。", 26, 0)  --对话
Cls()  --清屏
TalkEx("据属下所知，这位小兄弟一*直在寻找十四天书。", 234, 0)  --对话
Cls()  --清屏
TalkEx("哦？哈哈哈……小兄弟想做*武林盟主啊，其志不小，后*生可畏呀，哈哈哈……这十*四天书，老夫没有，不过却*知道其中一本书《笑傲江湖*》的下落，如果小兄弟能帮*我除掉东方不败，我就将此*书下落告诉你，如何？", 26, 0)  --对话
Cls()  --清屏
TalkEx("好，一言为定。", 0, 1)  --对话
Cls()  --清屏
TalkEx("小兄弟果然爽快，我们四人*先上黑木崖，小兄弟你也尽*快赶到。", 26, 0)  --对话
Cls()  --清屏
TalkEx("那东方不败武功深不可测，*小兄弟最好多带些武功高强*的人来。", 234, 0)  --对话
Cls()  --清屏
TalkEx("冲哥，我爹爹找东方不败算*帐，这是我们日月神教内部*的事，你……你还是别去了*……", 73, 0)  --对话
Cls()  --清屏
TalkEx("盈盈，对付东方不败，那是*艰危之极的事，我难道能置*身事外，忍心你去涉险？", 35, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，你们两个的情话还*没说够啊，等铲除了东方不*败，我让你们有的是时间说*情话，哈哈哈……我们走！", 26, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(26, 82,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(26, 96,0,0,0,0,0,7168,7168,7168,-2,-2,-2)  --修改场景事件
instruct_3(26, 97,0,0,0,0,0,7148,7148,7148,-2,-2,-2)  --修改场景事件
instruct_3(26, 83,0,0,0,0,911,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(26, 84,0,0,0,0,911,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(26, 85,0,0,0,0,911,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
